const express = require('express');
const app = express();
require('dotenv').config();
const port = process.env.PORT || 4000

const line = require('@line/bot-sdk');

const config = {
  channelAccessToken: process.env.token,
  channelSecret: process.env.secretCode
}

app.post('/webhook', line.middleware(config), (req, res) => {
  Promise
    .all([
      req.body.events.map(handleEvents)
    ])
    .then((result) => res.json(result))
})

const client = new line.Client(config);
async function handleEvents(event) {

  console.log(event.type);

  let stateAll = [
    "แนะนำเกม",
    "เกมไหนแตก",
    "แนะนำเกมหน่อยค่ะ",
    "ขอช่วงเวลาแตกหน่อยค่ะ",
    "ขอช่วงเวลาแตกหน่อยครับ",
    "แนะนำเกมหน่อยครับ",
    "เกมไหนมา",
    "ขอเกมแตกดี",
    "เกมไหนแตกดี",
    "เล่นไม่แตก",
    "ไม่แตกเลย",
    "แนะนำเกมหน่อย",
    "ไม่แตก",
    "แนะนำเกมหน่อยคะ",
    "เกมไรแตกดี",
    "เกมไรแตกดีคะ",
    "เกมไรแตกดีคับ",
    "เกมไรแตกดีครับ",
    "เกมไรแตกดีค่ะ",
    "พี่มีตารางเกมเข้าไหมคะ",
    "พี่มีตารางเกมเข้าไหม",
    "พี่มีตารางเกมเข้าไหมค่ะ",
    "พี่มีตารางเกมเข้าไหมคับ",
    "พี่มีตารางเกมเข้าไหมครับ",
    "พี่มีตารางเกมเข้ามั๊ย",
    "พี่มีตารางเกมเข้ามั๊ยคะ",
    "พี่มีตารางเกมเข้ามั๊ยค่ะ",
    "พี่มีตารางเกมเข้ามั๊ยครับ",
    "พี่มีตารางเกมเข้ามั๊ยคับ",
    "เกมไหนแตกเวลานี",
    "เกมไหนแตกเวลานี้",
    "เกมไหนแตกเวลานี้คะ",
    "เกมไหนแตกเวลานี้ค่ะ",
    "เกมไหนแตกเวลานี้คับ",
    "เกมไหนแตกเวลานี้ครับ",
    "เกมไหนแตกเวลานีค่ะ",
    "เกมไหนแตกเวลานีคะ",
    "เกมไหนแตกเวลานีคับ",
    "เกมไหนแตกเวลานีครับ",
    "โปรแนะนำเพื่อน",
    "โปรโมชั่นแนะนำเพื่อน",
    "แนะนำเพื่อน",
    "รายได้",
    "รายได้แนะนำเพื่อน",
    "ชวนเพื่อน",
    "ชวนเพื่อนได้อะไร",
    "มีแนะนำเพื่อนมั๊ย",
    "แนะนำเพื่อนได้เท่าไหร่",
    "แนะนำเพื่อนได้อะไรไหม",
    "แนะนำเพื่อนได้อะไรไหมคะ",
    "แนะนำเพื่อนได้อะไรไหมค่ะ",
    "แนะนำเพื่อนได้อะไรไหมคับ",
    "แนะนำเพื่อนได้อะไรไหมครับ",
    "โปรทายเลขท้าย",
    "ทายเลขท้าย",
    "ทายเลขท้ายยังไง",
    "โปรโมชั่นคืนยอดเสีย",
    "คืนยอดเสีย",
    "ไม่ได้ยอดเสีย",
    "รับยอดเสีย",
    "ยอดเสีย",
    "ยอดเสีย3%",
    "ยอดเสีย5%",
    "โปรคืนยอดเสีย",
    "มีคืนยอดเสียไหม",
    "มีคืนยอดเสียไหมคะ",
    "มีคืนยอดเสียไหมค่ะ",
    "มีคืนยอดเสียไหมคับ",
    "มีคืนยอดเสียไหมครับ",
    "รับยอดเสียตรงไหน",
    "รับยอดเสียตรงไหนคะ",
    "รับยอดเสียตรงไหนค่ะ",
    "รับยอดเสียตรงไหนคับ",
    "รับยอดเสียตรงไหนครับ",
    "ผมไม่ได้ยอดเสียเลยหรอ",
    "ผมไม่ได้ยอดเสียเลยหรอคับ",
    "ผมไม่ได้ยอดเสียเลยหรอครับ",
    "ไม่ได้ยอดเสียเลยหรอ",
    "ไม่ได้ยอดเสียเลยหรอคะ",
    "ไม่ได้ยอดเสียเลยหรอค่ะ",
    "ไม่ได้ยอดเสียเลยหรอคับ",
    "ไม่ได้ยอดเสียเลยหรอครับ",
    "โปรโมชั่นวันเกิด",
    "โปรวันเกิด",
    "วันเกิด",
    "วันเกิดมีอะไรให้มั๊ย",
    "มีโปรวันเกิดมั๊ย",
    "เกิดวันนี้ได้อะไร",
    "งานวันเกิดผมแจก500จริงป่าวครับ",
    "งานวันเกิดผมแจก500จริงป่าวคะ",
    "มีโปรวันเกิดมั้ยค่ะ",
    "มีโปรวันเกิดมั้ยครับ",
    "มีโปรวันเกิดมั้ย",
    "โปรโมชั่นมวย",
    "โปรมวย",
    "มีโปรมวยมั๊ย",
    "เล่นมวยมีโปรอะไร",
    "มวยมีโปรอะไร",
    "โปรมวย10%",
    "โปรมวย 10%",
    "โปรกีฬา",
    "มีโปรกีฬามั๊ย",
    "โปรบอล",
    "มีโปรแทงบอลมั๊ย",
    "โปรแทงบอล",
    "โปรโมชั่นกีฬา",
    "โปรโมชั่นกีฬา5%",
    "โปรกีฬา5%",
    "ฝากรับสูตร",
    "สมัครรับสูตร",
    "สูตร",
    "รับสูตร",
    "ขอสูตร",
    "สูตรสล็อต",
    "สูตรบา",
    "สูตรบาคาร่า",
    "สล็อต",
    "บาคาร่า",
    "โปรโมชั่นฝากรับสูตร",
    "สนใจรับสูตร",
    "รับฟรีสูตรสแกน",
    "รับฟรีสูตรสแกนค่ะ",
    "รับฟรีสูตรสแกนคับ",
    "รับฟรีสูตรสแกนครับ",
    "รับฟรีสูตรสแกนคะ",
    "สูตรสแกน",
    "ขอรับสูตร",
    "ขอรับสูตรค่ะ",
    "ขอรับสูตรคะ",
    "ขอรับสูตรครับ",
    "ขอรับสูตรคับ",
    "รับสูตรสล็อตตรงไหน",
    "รับสูตรสล็อตตรงไหนคะ",
    "รับสูตรสล็อตตรงไหนค่ะ",
    "รับสูตรสล็อตตรงไหนคับ",
    "รับสูตรสล็อตตรงไหนครับ",
    "รูเล็ต",
    "รููเล็ตเดิมพันขั้นต่ำกี่บาท",
    "รูเล็ตจ่ายสูงสุดกี่บาท",
    "เล่นรูเล็ต",
    "วิธีเล่นรูเล็ต",
    "ไฮโล",
    "เล่นไฮโลยังไง",
    "ไฮโลจ่ายสูงสุดกี่บาท",
    "ไฮโลเดิมพันขั้นต่ำกี่บาท",
    "วิธีเล่นไฮโล",
    "วิธีปรับเบทสล็อต",
    "ปรับเบทยังไง",
    "สล็อตปรับเบท",
    "กดเบท20ยังไง",
    "วิธีการซื้อฟรีสปิน",
    "ฟรีสปิน",
    "ซื้อฟรีสปิน",
    "ซื้อฟรีสปินยังไง",
    "ซื้อฟีเจอร์ยังไง",
    "ซื้อฟีเจอร์",
    "วิธีเล่นบาคาร่าสายฟ้า",
    "บาคาร่าสายฟ้าเล่นยังไง",
    "บาคาร่าสายฟ้าเดิมพันขั้นต่ำกี่",
    "บาคาร่าสายฟ้า",
    "บาสายฟ้า",
    "วิธีเล่นบาคาร่าวัว",
    "บาคาร่าวัววัว",
    "บาวัววัว",
    "เล่นบาคาร่าวัววัว",
    "บาคาร่าวัววัวเล่นยังไง",
    "บาคาร่าวัววัวคืออะไร",
    "บาคาร่าวัว วัว เล่นยังไง",
    "บาคาร่า วัว วัว เดินพันขั้นต่ำ",
    "ปรับค่าคอมบาคาร่า",
    "บาค่าร่าเล่นแบบไม่มีค่าคอมเป็น",
    "เล่นบาแบบไม่มีค่าคอม",
    "ปรับค่าคอมบา",
    "วิธีปรับค่าคอมบาคาร่า",
    "วิธีแทงมวย",
    "มวย",
    "แทงมวย",
    "แนะนำค่ายบอล",
    "ค่ายไหนน้ำเยอะ",
    "ค่ายไหนค่าน้ำเยอะสุด",
    "วิธีดูบอลสเต็ป",
    "ดูบอลสเต็ป",
    "บอลสเต็ป",
    "สเต็ปบอล",
    "แทงบอลสเต็ป",
    "แทงบอลสต็ปตรงไหน",
    "วิธีแทงบอลสเต็ป",
    "วิธีดูบิลบอล",
    "ดูบิลบอล",
    "บิลบอล",
    "บิลบอลดูยังไง",
    "ดูบิล",
    "บิลบอลหายทำยังไง",
    "เช็คตั๋ว",
    "วิธีแทงบอล",
    "แทงบอล",
    "แทงบอลยังไง",
    "อยากแทงบอล",
    "แทงบอลสโบ",
    "กีฬา",
    "แอป",
    "มีแอปมั๊ย",
    "เพิ่มแอป",
    "ติดตั้งแอป",
    "มีแอฟป่าวครับ",
    "มีแอฟป่าวค่ะ",
    "มีแอฟมั๊ย",
    "โหลดแอปลงหน้าโฮมยังไง",
    "โหลดแอปลงหน้าโฮมยังไงคะ",
    "โหลดแอปลงหน้าโฮมยังไงค่ะ",
    "โหลดแอปลงหน้าโฮมยังไงคับ",
    "โหลดแอปลงหน้าโฮมยังไงครับ",
    "ปรับยอดเดิมพันเพิ่มไม่ได้",
    "ปรับยอดเดิมพัน",
    "เพิ่มยอดเดิมพัน",
    "เปลี่ยนภาษา",
    "เปลี่ยนภาษายังไง",
    "ขั้นตอนเปลี่ยนภาษา",
    "เปลี่ยนภาษาทำยังไง",
    "อยากเปลี่ยนภาษา",
    "มีเปลี่ยนภาษามั๊ย",
    "เปลี่ยนภาษาตรงไหน",
    "ภาษา",
    "เปลี่ยนภาษาไทย",
    "จะเปลี่ยนเป็นภาษาไทยยังไง",
    "จำยูสไม่ได้",
    "จำยูสไม่ได้ครับ",
    "จำยูสไม่ได้ค่ะ",
    "จำยูสไม่ได้คะ",
    "จำuserไม่ได้ครับ",
    "จำuserไม่ได้คับ",
    "จำ user ไม่ได้",
    "จำ user ไม่ได้ค่ะ",
    "จำ user ไม่ได้คะ",
    "จำ user ไม่ได้คับ",
    "จำ user ไม่ได้ครับ",
    "จำยูสไม่ได้คับ",
    "จำuserไม่ได้",
    "จำuserไม่ได้ค่ะ",
    "จำuserไม่ได้คะ",
    "ต้องการเปลี่ยนเบอร์โทร",
    "เปลี่ยนเบอร์ได้ไหม",
    "เปลี่ยนเบอร์",
    "จะเปลี่ยนเบอร์",
    "อยากเปลี่ยนเบอร์โทร",
    "อยากเปลี่ยนเบอร์",
    "ต้องการเปลี่ยนเบอร์โทรค่ะ",
    "ต้องการเปลี่ยนเบอร์โทรคะ",
    "ต้องการเปลี่ยนเบอร์โทรคับ",
    "ต้องการเปลี่ยนเบอร์โทรครับ",
    "เปลี่ยนเบอร์ได้ไหมค่ะ",
    "เปลี่ยนเบอร์ได้ไหมคะ",
    "เปลี่ยนเบอร์ได้ไหมคับ",
    "เปลี่ยนเบอร์ได้ไหมครับ",
    "เปลี่ยนเบอร์ค่ะ",
    "เปลี่ยนเบอร์คะ",
    "เปลี่ยนเบอร์คับ",
    "เปลี่ยนเบอร์ครับ",
    "อยากเปลี่ยนเบอร์โทรค่ะ",
    "อยากเปลี่ยนเบอร์โทรคะ",
    "อยากเปลี่ยนเบอร์โทรคับ",
    "อยากเปลี่ยนเบอร์โทรครับ",
    "อยากเปลี่ยนเบอร์ค่ะ",
    "อยากเปลี่ยนเบอร์คะ",
    "อยากเปลี่ยนเบอร์คับ",
    "อยากเปลี่ยนเบอร์ครับ",
    "จำรหัสผ่าน​ไม่ได้",
    "ลืมรหัสผ่าน",
    "ลืมรหัส",
    "จำรหัสผ่าน​ไม่ได้ค่ะ",
    "จำรหัสผ่าน​ไม่ได้ครับ",
    "ลืมรหัสผ่านค่ะ",
    "ลืมรหัสผ่านครับ",
    "ขอUser หน่อยค่ะ",
    "ขอUser หน่อยคะ",
    "ขอUser หน่อย",
    "ขอUser หน่อยคับ",
    "ขอUser หน่อยครับ",
    "ขอยูสหน่อย",
    "ขอยูสหน่อยค่ะ",
    "ขอยูสหน่อยคะ",
    "ขอยูสหน่อยครับ",
    "ขอยูสหน่อยคับ",
    "เข้าเล่นไม่ได้",
    "เข้าเล่นยังไง",
    "ทำไมเข้าไม่ได้",
    "เข้าเล่น",
    "ทางเข้าเล่น",
    "เข้าไม่ได้",
    "เข้าเว็บไม่ได้",
    "เว็บเข้าไม่ได้",
    "ระบบเข้าไม่ได้หรอคะ",
    "ระบบเข้าไม่ได้หรอครับ",
    "ระบบเข้าไม่ได้ค่ะ",
    "ระบบเข้าไม่ได้ครับ",
    "ระบบเข้าไม่ได้",
    "ขอลิงค์",
    "ลิงค์",
    "ทำไมเข้าหน้าเว็ปไม่ได้ครับ",
    "ทำไมเข้าหน้าเว็ปไม่ได้คะ",
    "ทำไมแอปเข้าไม่ได้ค่ะ",
    "ทำไมแอปเข้าไม่ได้ครับ",
    "เข้าเล่นตรงไหนคะ",
    "เข้าเล่นตรงไหนครับ",
    "ทางเข้า",
    "ทางเข้าครับ",
    "ทางเข้าค่ะ",
    "เว็บเข้าไม่ได้ครับ",
    "เว็บเข้าไม่ได้ค่ะ",
    "เว็บเข้าไม่ได้คะ",
    "จะเข้าเล่น",
    "จะเข้าเล่นครับ",
    "จะเข้าเล่นคับ",
    "จะเข้าเล่นค่ะ",
    "จะเข้าเล่นคะ",
    "เว็บเข้าไม่ได้คับ",
    "จะเข้าเล่นเว็บ",
    "จะเข้าเล่นเว็บครับ",
    "จะเข้าเล่นเว็บคับ",
    "จะเข้าเล่นเว็บคะ",
    "จะเข้าเล่นเว็บค่ะ",
    "เข้าเว็บไม่ได้ค่ะ",
    "เข้าเว็บไม่ได้คะ",
    "เข้าเว็บไม่ได้ครับ",
    "เข้าเว็บไม่ได้คับ",
    "กดเข้าหน้าเว็บไม่ได้",
    "กดเข้าหน้าเว็บไม่ได้ค่ะ",
    "กดเข้าหน้าเว็บไม่ได้ครับ",
    "กดเข้าหน้าเว็บไม่ได้คับ",
    "เข้าหน้าเว็บไม่ได้",
    "เข้าหน้าเว็บไม่ได้ค่ะ",
    "ข้าหน้าเว็บไม่ได้คะ",
    "เข้าหน้าเว็บไม่ได้ครับ",
    "เข้าหน้าเว็บไม่ได้คับ",
    "ถอนเงินนาน",
      "ถอนนาน",
      "ถอนนานมาก",
      "ถอนนานมากครับ",
      "ถอนนานมากค่ะ",
      "ตรวจสอบ",
      "ถอนเงินนาน (ตรวจสอบ)",
      "ถอนตังยังไม่เข้าเลยครับ",
      "ถอนตังยังไม่เข้าเลยคับ",
      "ถอนตังยังไม่เข้าเลยค่ะ",
      "ถอนตังยังไม่เข้าเลยคะ",
      "ถอนยังไม่เข้าครับ",
      "ถอนยังไม่เข้าคับ",
      "ถอนยังไม่เข้าค่ะ",
      "ถอนยังไม่เข้าคะ",
      "ถอนเงินแล้วได้เงินไม่ครบ",
    "ติดเทิร์น",
    "ถอนเงินไม่ครบ",
    "ทำไมถึงถอนไม่ได้ครับ",
    "กดถอนตังไม่ได้",
    "กดถอนตังไม่ได้ค่ะ",
    "กดถอนตังไม่ได้คะ",
    "กดถอนตังไม่ได้คับ",
    "กดถอนตังไม่ได้ครับ",
    "ทำไมถึงถอนไม่ได้คะ",
    "ทำไมถึงถอนไม่ได้ค่ะ",
    "ทำไมถึงถอนไม่ได้คับ",
    "ถอนไม่สำเร็จ",
    "ถอนไม่สำเร็จค่ะ",
    "ถอนไม่สำเร็จคะ",
    "ถอนไม่สำเร็จคับ",
    "ถอนไม่สำเร็จครับ",
    "ถอนเงินไม่ได้ครับ",
    "ถอนเงินไม่ได้คับ",
    "ถอนเงินไม่ได้ค่ะ",
    "ถอนเงินไม่ได้คะ",
    "แจ้งถอนแต่เงินยังไม่เข้านะคะ",
    "แจ้งถอนแต่เงินยังไม่เข้าค่ะ",
    "แจ้งถอนแต่เงินยังไม่เข้า",
    "ถอนเงินไม่ได้",
    "ถอนไม่เหนเข้าสักที",
    "ถอนไม่เหนเข้าสักทีค่ะ",
    "ถอนไม่เหนเข้าสักทีคะ",
    "ถอนไม่เหนเข้าสักทีคับ",
    "ถอนไม่เหนเข้าสักทีครับ",
    "ถอนไม่เห็นเข้าสักที",
    "ถอนไม่เห็นเข้าสักทีค่ะ",
    "ถอนไม่เห็นเข้าสักทีคะ",
    "ถอนไม่เห็นเข้าสักทีคับ",
    "ถอนไม่เห็นเข้าสักทีครับ",
    "วิธีการถอน",
    "ถอนเงิน",
    "ถอน",
    "ถอนค่ะ",
    "ถอนคะ",
    "ถอนครับ",
    "ถอนคับ",
    "ต้องการถอน",
    "ถอนเงินไม่ได้",
    "ถอนเงินยังไง",
    "แจ้งถอนเงิน",
    "กดถอนไม่ได้",
    "กดระบุยอดถอนไม่ได้",
    "ถอนเงินครับ",
    "ถอนเงินค่ะ",
    "ถอนเงินคะ",
    "ถอนค่ะ",
    "ถอนครับ",
    "ถอนเงินหน่อย",
    "ถอนเงินหน่อยค่ะ",
    "ถอนเงินหน่อยคะ",
    "ถอนเงินหน่อยครับ",
    "ถอนเงินหน่อยคับ",
    "ถอนเงินให้หน่อย",
    "ถอนเงินให้หน่อยครับ",
    "ถอนเงินให้หน่อยคับ",
    "ถอนเงินให้หน่อยค่ะ",
    "ถอนเงินให้หน่อยคะ",
    "แจ้งถอน",
    "แจ้งถอนค่ะ",
    "แจ้งถอนคะ",
    "แจ้งถอนคับ",
    "แจ้งถอนครับ",
    "ถอนเงินยังไม่ได้",
    "ถอนเงินยังไม่ได้ค่ะ",
    "ถอนเงินยังไม่ได้คะ",
    "ถอนเงินยังไม่ได้คับ",
    "ถอนเงินยังไม่ได้ครับ",
    "ถอนไม่เข้า",
    "ถอนไม่เข้าค่ะ",
    "ถอนไม่เข้าคะ",
    "ถอนไม่เข้าคับ",
    "ถอนไม่เข้าครับ",
    "ถอนแล้วยอดไม่เข้าครับ",
    "ถอนแล้วยอดไม่เข้าคับ",
    "ถอนแล้วยอดไม่เข้าค่ะ",
    "ถอนแล้วยอดไม่เข้าคะ",
    "วิธีการถอนเงิน",
    "วิธีการถอนเงินครับ",
    "วิธีการถอนเงินคับ",
    "วิธีการถอนเงินค่ะ",
    "วิธีการถอนเงินคะ",
    "วิธีถอนเงิน",
    "ถอนเงินหน่อยครับ",
    "ถอนเงินหน่อยคับ",
    "ถอนเงินหน่อยคะ",
    "ถอนเงินหน่อยค่ะ",
    "ถอนให้หน่อย",
    "ฝาก - ถอนขั้นต่ำเท่าไหร่",
    "ฝากขั้นต่ำเท่าไหร่",
    "ถอนขั้นต่ำเท่าไหร่",
    "ฝากถอนขั้นต่ำเท่าไหร่ครับ",
    "ฝากถอนขั้นต่ำเท่าไหร่",
    "ฝากถอนขั้นต่ำเท่าไหร่คับ",
    "ฝากถอนขั้นต่ำเท่าไหร่คะ",
    "ฝากถอนขั้นต่ำเท่าไหร่ค่ะ",
    "ฝากถอนขั้นต่ำเท่าไรครับ",
    "ฝากถอนขั้นต่ำเท่าไรคับ",
    "ฝากถอนขั้นต่ำเท่าไรคะ",
    "ฝากถอนขั้นต่ำเท่าไรค่ะ",
    "ฝากถอนขั้นต่ำเท่าไร",
    "อัปสลิป",
    "อัพสลิปไม่ได้",
    "อัพสลิปยังไง",
    "สลิป",
    "อัปสลิปไม่ได้",
    "กดอัพสลิปตรงไหน",
    "กดอัปสลิปตรงไหน",
    "กดอัปสลิปตรงไหนคับ",
    "กดอัปสลิปตรงไหนครับ",
    "กดอัปสลิปตรงไหนคะ",
    "กดอัปสลิปตรงไหนค่ะ",
    "อัพสลิป",
    "อัพสลีป",
    "อัปโหลดสลิปไม่ได้",
    "อัปโหลดสลิปไม่ได้ครับ",
    "อัปโหลดสลิปไม่ได้ค่ะ",
    "อัปโหลดสลิปไม่ได้คะ",
    "อัปโหลดสลิปไม่ได้คับ",
    "อัปสลิปคับ",
    "อัปสลิปครับ",
    "อัปสลิปค่ะ",
    "อัปสลิปคะ",
    "อัพสลิปไม่ได้ครับ",
    "อัพสลิปไม่ได้ค่ะ",
    "อัพสลิปไม่ได้คับ",
    "อัพสลิปไม่ได้คะ",
    "อัพสลิปยังไงคับ",
    "อัพสลิปยังไงคะ",
    "อัพสลิปยังไงครับ",
    "อัพสลิปยังไงค่ะ",
    "อัปสลิปหน่อย",
    "อัปสลิปหน่อยครับ",
    "อัปสลิปหน่อยค่ะ",
    "อัปสลิปหน่อยคะ",
    "อัปสลิปหน่อยคับ",
    "อัพสลิปหน่อย",
    "อัพสลิปหน่อยครับ",
    "อัพสลิปหน่อยคะ",
    "อัพสลิปหน่อยค่ะ",
    "อัพสลิปหน่อยคับ",
    "อัปสลิปไม่ได้ค่ะ",
    "อัปสลิปไม่ได้ครับ",
    "อัปสลิปไม่ได้คับ",
    "อัปสลิปไม่ได้คะ",
    "ฝากเงินไม่เข้า",
    "ฝากแล้วเครดิตไม่เข้า",
    "เงินไม่เข้า",
    "ฝากไม่เข้า",
    "เครดิตไม่เข้า",
    "ฝากเงินไม่เข้าครับ",
    "ฝากยอดแล้วไม่เข้าครับ",
    "ฝากยอดแล้วไม่เข้าคับ",
    "ฝากยอดแล้วไม่เข้าค่ะ",
    "ฝากยอดแล้วไม่เข้าคะ",
    "ตังไม่เข้า",
    "ตังไม่เข้าครับ",
    "ตังไม่เข้าค่ะ",
    "ตังไม่เข้าคะ",
    "ยอดไม่ออโต้",
    "ยอดไม่ออโต้ครับ",
    "ยอดไม่ออโต้คับ",
    "ยอดไม่ออโต้ค่ะ",
    "ยอดไม่ออโต้คะ",
    "ฝากเงินไม่เข้าคับ",
    "ฝากเงินไม่เข้าค่ะ",
    "ฝากเงินไม่เข้าคะ",
    "ฝากแล้วเครดิตไม่เข้าครับ",
    "ฝากแล้วเครดิตไม่เข้าค่ะ",
    "ฝากแล้วเครดิตไม่เข้าคับ",
    "ฝากแล้วเครดิตไม่เข้าคะ",
    "เงินไม่เข้าค่ะ",
    "เงินไม่เข้าคะ",
    "เงินไม่เข้าคับ",
    "เงินไม่เข้าครับ",
    "ฝากไม่เข้าค่ะ",
    "ฝากไม่เข้าคะ",
    "ฝากไม่เข้าครับ",
    "ฝากไม่เข้าคับ",
    "เครดิตไม่เข้าครับ",
    "เครดิตไม่เข้าคับ",
    "เครดิตไม่เข้าค่ะ",
    "เครดิตไม่เข้าคะ",
    "เงินเข้าช้าจัง",
    "เงินเข้าช้าจังค่ะ",
    "เงินเข้าช้าจังคะ",
    "เงินเข้าช้าจังคับ",
    "เงินเข้าช้าจังครับ",
    "ยอดไม่มา",
    "ยอดไม่มาค่ะ",
    "ยอดไม่มาคะ",
    "ยอดไม่มาคับ",
    "ยอดไม่มาครับ",
    "ยอดยังไม่เข้า",
    "ยอดยังไม่เข้าค่ะ",
    "ยอดยังไม่เข้าคะ",
    "วิธีฝาก",
    "ฝากเงิน",
    "ฝากยังไง",
    "ขอเลขบัญชีฝาก",
    "ฝากเงินหน่อยครับ",
    "ฝากเงินหน่อยค่ะ",
    "ฝาก",
    "ฝากค่ะ",
    "ฝากครับ",
    "ฝากเงินครับ",
    "ฝากเงินค่ะ",
    "ฝากแล้วค่ะ",
    "ฝากแล้วครับ",
    "ฝากเงินหน่อย",
    "ฝาก เงิน",
    "วิธีฝากเงิน",
    "วิธีการฝากเงิน",
    "ฝากได้เลยมั้ยคะ",
    "ฝากได้เลยมั้ย",
    "ฝากได้เลยมั้ยค่ะ",
    "ฝากได้เลยมั้ยครับ",
    "ฝากได้เลยมั้ยคับ",
    "ฝากหน้าเวปเลยได้มั้ย",
    "ฝากหน้าเวปเลยได้มั้ยคะ",
    "ฝากหน้าเวปเลยได้มั้ยค่ะ",
    "ฝากหน้าเวปเลยได้มั้ยคับ",
    "ฝากหน้าเวปเลยได้มั้ยครับ",
    "ฝากหน้าเว็บเลยได้มั้ย",
    "ฝากหน้าเว็บเลยได้มั้ยคะ",
    "ฝากหน้าเว็บเลยได้มั้ยค่ะ",
    "ฝากหน้าเว็บเลยได้มั้ยคับ",
    "ฝากหน้าเว็บเลยได้มั้ยครับ",
    "ต้องการให้เราสมัครสมาชิกให้",
    "สมัครไม่ได้ครับ",
    "สมัครไม่ได้ค่ะ",
    "สมัครไม่ได้",
    "สมัครไม่ได้ทำไง",
    "สมัครไม่ได้ทำยังไงครับ",
    "สมัครไม่ได้ทำยังไงคะ",
    "สมัครไม่ได้ทำยังไงค่ะ",
    "สมัครไม่ได้ทำไงครับ",
    "สมัครไม่ได้ทำไงคับ",
    "สมัครไม่ได้คับ",
    "สมัครไม่เห็นได้",
    "สมัครให้หน่อย",
    "สมัครให้หน่อยค่ะ",
    "สมัครให้หน่อยคับ",
    "สมัครให้หน่อยครับ",
    "สมัครให้หน่อยคะ",
    "เเอดสมัครให้หน่อย",
    "เเอดสมัครให้หน่อยค่ะ",
    "เเอดสมัครให้หน่อยคะ",
    "เเอดสมัครให้หน่อยคับ",
    "เเอดสมัครให้หน่อยครับ",
    "แอดสมัครให้หน่อย",
    "แอดสมัครให้หน่อยค่ะ",
    "แอดสมัครให้หน่อยคะ",
    "แอดสมัครให้หน่อยครับ",
    "แอดสมัครให้หน่อยคับ",
    "สมัครแล้ว ติดปัญหา",
    "สมัครแล้วแต่เข้าเล่นไม่ได้",
    "สมัครแล้วแต่เข้าเล่นไม่ได้ค่ะ",
    "สมัครแล้วแต่เข้าเล่นไม่ได้คะ",
    "สมัครแล้วแต่เข้าเล่นไม่ได้ครับ",
    "สมัครแล้วแต่เข้าเล่นไม่ได้คับ",
    "สมัครสมาชิก",
    "ต้องการสมัครสมาชิก",
    "สมัครแล้วขอรับเครดิตฟรี",
    "ต้องการสมัคร",
    "สมัคร",
    "สมัครยังไง",
    "ลิงก์สมัคร",
    "สมัครหน่อยครับ",
    "ขอสมัคร",
    "สมัครค่ะ",
    "สมัครครับ",
    "ต้องการสมัครสมาชิกออโต้",
    "สมัครหน่อย",
    "สมัครหน่อยค่ะ",
    "สมัครคะ",
    "สนใจสมัครครับ",
    "สนใจสมัครค่ะ",
    "สนใจสมัคร",
    "สนใจสมัครคะ",
    "สนใจสมัครหน่อยครับ",
    "สนใจสมัครหน่อยค่ะ",
    "สนใจสมัครหน่อยคะ",
    "สมัค",
    "สมัคครับ",
    "สมัคค่ะ",
    "สมัคคะ",
    "ติดต่อเรา",
    "#สมัครสมาชิก",
    "#ฝาก-ถอน",
    "#แจ้งปัญหาการใช้งาน",
    "#ข้อมูลการเล่นเกม",
    "#โปรโมชั่น"
  ]

  const flexMenu = {
    type: 'flex',
    altText: 'เลือกหัวข้อที่ต้องการสอบถาม',
    contents: {
      "type": "bubble",
      "hero": {
        "type": "image",
        "url": "https://lh3.googleusercontent.com/d/1iPLMDqZoy_q8YjSMRbV-WY5QtDDB_u7Z",
        "size": "full",
        "aspectRatio": "20:13",
        "aspectMode": "cover"
      },
      "body": {
        "type": "box",
        "layout": "vertical",
        "contents": [
          {
            "type": "text",
            "text": "เลือกหัวข้อที่ต้องการสอบถาม",
            "align": "center",
            "size": "lg",
            "color": "#333333",
            "weight": "bold"
          },
          {
            "type": "box",
            "layout": "vertical",
            "contents": [
              {
                "type": "button",
                "action": {
                  "type": "message",
                  "label": "สมัครสมาชิก",
                  "text": "#สมัครสมาชิก"
                },
                "margin": "none",
                "height": "sm",
                "style": "primary"
              }
            ],
            "margin": "xs",
            "spacing": "none",
            "paddingAll": "xs"
          },
          {
            "type": "box",
            "layout": "vertical",
            "contents": [
              {
                "type": "button",
                "action": {
                  "type": "message",
                  "label": "ฝาก-ถอน",
                  "text": "#ฝาก-ถอน"
                },
                "margin": "none",
                "height": "sm",
                "style": "primary"
              }
            ],
            "margin": "xs",
            "spacing": "none",
            "paddingAll": "xs"
          },
          {
            "type": "box",
            "layout": "vertical",
            "contents": [
              {
                "type": "button",
                "action": {
                  "type": "message",
                  "label": "แจ้งปัญหาการใช้งาน",
                  "text": "#แจ้งปัญหาการใช้งาน"
                },
                "margin": "none",
                "height": "sm",
                "style": "primary"
              }
            ],
            "margin": "xs",
            "spacing": "none",
            "paddingAll": "xs"
          },
          {
            "type": "box",
            "layout": "vertical",
            "contents": [
              {
                "type": "button",
                "action": {
                  "type": "message",
                  "label": "ข้อมูลการเล่นเกม",
                  "text": "#ข้อมูลการเล่นเกม"
                },
                "margin": "none",
                "height": "sm",
                "style": "primary"
              }
            ],
            "margin": "xs",
            "spacing": "none",
            "paddingAll": "xs"
          },
          {
            "type": "box",
            "layout": "vertical",
            "contents": [
              {
                "type": "button",
                "action": {
                  "type": "message",
                  "label": "โปรโมชั่น",
                  "text": "#โปรโมชั่น"
                },
                "margin": "none",
                "height": "sm",
                "style": "primary"
              }
            ],
            "margin": "xs",
            "spacing": "none",
            "paddingAll": "xs"
          },
          {
            "type": "box",
            "layout": "vertical",
            "contents": [
              {
                "type": "button",
                "action": {
                  "type": "message",
                  "label": "แนะนำเกม",
                  "text": "แนะนำเกม"
                },
                "margin": "none",
                "height": "sm",
                "style": "primary"
              }
            ],
            "margin": "xs",
            "spacing": "none",
            "paddingAll": "xs"
          },
        ]
      },
      "styles": {
        "hero": {
          "separator": true
        }
      }
    }

  };
  // แนะนำเกม
  let stateGameSuggest = [
    "แนะนำเกม",
    "เกมไหนแตก",
    "แนะนำเกมหน่อยค่ะ",
    "ขอช่วงเวลาแตกหน่อยค่ะ",
    "ขอช่วงเวลาแตกหน่อยครับ",
    "แนะนำเกมหน่อยครับ",
    "เกมไหนมา",
    "ขอเกมแตกดี",
    "เกมไหนแตกดี",
    "เล่นไม่แตก",
    "ไม่แตกเลย",
    "แนะนำเกมหน่อย",
    "ไม่แตก",
    "แนะนำเกมหน่อยคะ",
    "เกมไรแตกดี",
    "เกมไรแตกดีคะ",
    "เกมไรแตกดีคับ",
    "เกมไรแตกดีครับ",
    "เกมไรแตกดีค่ะ",
    "พี่มีตารางเกมเข้าไหมคะ",
    "พี่มีตารางเกมเข้าไหม",
    "พี่มีตารางเกมเข้าไหมค่ะ",
    "พี่มีตารางเกมเข้าไหมคับ",
    "พี่มีตารางเกมเข้าไหมครับ",
    "พี่มีตารางเกมเข้ามั๊ย",
    "พี่มีตารางเกมเข้ามั๊ยคะ",
    "พี่มีตารางเกมเข้ามั๊ยค่ะ",
    "พี่มีตารางเกมเข้ามั๊ยครับ",
    "พี่มีตารางเกมเข้ามั๊ยคับ",
    "เกมไหนแตกเวลานี",
    "เกมไหนแตกเวลานี้",
    "เกมไหนแตกเวลานี้คะ",
    "เกมไหนแตกเวลานี้ค่ะ",
    "เกมไหนแตกเวลานี้คับ",
    "เกมไหนแตกเวลานี้ครับ",
    "เกมไหนแตกเวลานีค่ะ",
    "เกมไหนแตกเวลานีคะ",
    "เกมไหนแตกเวลานีคับ",
    "เกมไหนแตกเวลานีครับ"
    
  ]
  const flexGameSuggest ={
    type: 'flex',
    altText: 'GameSuggest',
    contents:
    {
      "type": "bubble",
      "size": "giga",
      "body": {
        "type": "box",
        "layout": "vertical",
        "contents": [
          {
            "type": "image",
            "url": "https://lh3.googleusercontent.com/d/1HEJTtTUpQntFbglj0oerBne2w49tNZZB",
            "size": "full",
            "aspectMode": "cover",
            "aspectRatio": "2:3.1",
            "gravity": "center"
          }
        ],
        "paddingAll": "0px"
      }
    }
  }
  const textGameSuggest = {
    type: 'text',
    text: `🧮 น้องแอดมินเก็บสถิติเกมแตกดี 
✔ ได้ถอนชัวร์ คัดเกมท็อปๆ มาให้เลยค่ะ ลองเล่นตามดูนะคะ`
  };
  // โปรโมชั่นแนะนำเพื่อน
  let stateFriendSuggest = [
    "โปรแนะนำเพื่อน",
    "โปรโมชั่นแนะนำเพื่อน",
    "แนะนำเพื่อน",
    "รายได้",
    "รายได้แนะนำเพื่อน",
    "ชวนเพื่อน",
    "ชวนเพื่อนได้อะไร",
    "มีแนะนำเพื่อนมั๊ย",
    "แนะนำเพื่อนได้เท่าไหร่",
    "แนะนำเพื่อนได้อะไรไหม",
    "แนะนำเพื่อนได้อะไรไหมคะ",
    "แนะนำเพื่อนได้อะไรไหมค่ะ",
    "แนะนำเพื่อนได้อะไรไหมคับ",
    "แนะนำเพื่อนได้อะไรไหมครับ"
  ];
  const flexFriendSuggest ={
    type: 'flex',
    altText: 'FriendSuggest',
    contents:
    {
      "type": "bubble",
      "size": "giga",
      "body": {
        "type": "box",
        "layout": "vertical",
        "contents": [
          {
            "type": "image",
            "url": "https://lh3.googleusercontent.com/d/1IJZcwUC1LhMMxtDSlEtE8k9R0QM0VMwY",
            "size": "full",
            "aspectMode": "cover",
            "aspectRatio": "1:1",
            "gravity": "center"
          }
        ],
        "paddingAll": "0px"
      }
    }
  }
  const flexFriendSuggest1 ={
    type: 'flex',
    altText: 'FriendSuggest1',
    contents:
    {
      "type": "bubble",
      "size": "giga",
      "body": {
        "type": "box",
        "layout": "vertical",
        "contents": [
          {
            "type": "image",
            "url": "https://lh3.googleusercontent.com/d/170mgBFjodbrdG5Fp4isLIDLvIw0Er8vr",
            "size": "full",
            "aspectMode": "cover",
            "aspectRatio": "1:1",
            "gravity": "center"
          }
        ],
        "paddingAll": "0px"
      }
    }
  }
  const textFriendSuggest = {
    type: 'text',
    text: `✨ ค่าคอมในการแนะนำเพื่อน เว็บเราให้สูงสุดถึง 0.5%
👆  คุณพี่สามารถดูขั้นตอนแนะนำเพื่อน ได้ตามภาพด้านบนเลยค่ะ
😍 หากสงสัยตรงไหนเพิ่มเติม ทักแอดมินได้เลยทันที ขอบคุณค่ะ`
  };

  // โปรทายเลขท้าย
  let stateProLastUser = [
    "โปรทายเลขท้าย",
    "ทายเลขท้าย",
    "ทายเลขท้ายยังไง"
  ];
  const flexProtLasUser ={
    type: 'flex',
    altText: 'ProLastUser',
    contents:
    {
      "type": "bubble",
      "size": "giga",
      "body": {
        "type": "box",
        "layout": "vertical",
        "contents": [
          {
            "type": "image",
            "url": "https://lh3.googleusercontent.com/d/1E-WITq9qGECfIHpW-IhO--tDyVHPxq8A",
            "size": "full",
            "aspectMode": "cover",
            "aspectRatio": "1:1",
            "gravity": "center"
          }
        ],
        "paddingAll": "0px"
      }
    }
  }
  const textProLastUser = {
    type: 'text',
    text: `⚡ เงื่อนไขโปรโมชั่น เลขท้ายยูสเซอร์
◾ ถูก 2 ตัวได้ 500 บาท
◾ ถูก 3 ตัวได้ 1000 บาท
⚠️ ก่อนร่วมโปรโมชั่น ต้องมียอดฝากสะสม 3000 บาท ภายใน 15 วัน ก่อนวันหวยออกนะคะ`
  };

  // โปรโมชั่นคืนยอดเสีย
  let stateReturnLose = [
    "โปรโมชั่นคืนยอดเสีย",
    "คืนยอดเสีย",
    "ไม่ได้ยอดเสีย",
    "รับยอดเสีย",
    "ยอดเสีย",
    "ยอดเสีย3%",
    "ยอดเสีย5%",
    "โปรคืนยอดเสีย",
    "มีคืนยอดเสียไหม",
    "มีคืนยอดเสียไหมคะ",
    "มีคืนยอดเสียไหมค่ะ",
    "มีคืนยอดเสียไหมคับ",
    "มีคืนยอดเสียไหมครับ",
    "รับยอดเสียตรงไหน",
    "รับยอดเสียตรงไหนคะ",
    "รับยอดเสียตรงไหนค่ะ",
    "รับยอดเสียตรงไหนคับ",
    "รับยอดเสียตรงไหนครับ",
    "ผมไม่ได้ยอดเสียเลยหรอ",
    "ผมไม่ได้ยอดเสียเลยหรอคับ",
    "ผมไม่ได้ยอดเสียเลยหรอครับ",
    "ไม่ได้ยอดเสียเลยหรอ",
    "ไม่ได้ยอดเสียเลยหรอคะ",
    "ไม่ได้ยอดเสียเลยหรอค่ะ",
    "ไม่ได้ยอดเสียเลยหรอคับ",
    "ไม่ได้ยอดเสียเลยหรอครับ",
  ];
  const flexReturnLose ={
    type: 'flex',
    altText: 'ReturnLose',
    contents:
    {
      "type": "bubble",
      "size": "giga",
      "body": {
        "type": "box",
        "layout": "vertical",
        "contents": [
          {
            "type": "image",
            "url": "https://lh3.googleusercontent.com/d/1rpn2RzfJFY0x6k24hM92cDRwJAI2w-7u",
            "size": "full",
            "aspectMode": "cover",
            "aspectRatio": "1:1",
            "gravity": "center"
          }
        ],
        "paddingAll": "0px"
      }
    }
  }
  const textReturnLose = {
    type: 'text',
    text: `💜 ดูรายละเอียดการคืนยอดเสีย ตามภาพได้เลยค่ะ 
⭐ หากพี่มียอดเสียถึง 3,000 สามารถแจ้งรับได้เลยทุกวัน 1-3 ของเดือน แอดมินตรวจสอบยอดเสียให้ค่ะ รบกวนพิมพ์ ชื่อ-นามสกุล เบอร์โทร`
  };

  // โปรโมชั่นวันเกิด
  let stateProBirthday = [
    "โปรโมชั่นวันเกิด",
    "โปรวันเกิด",
    "วันเกิด",
    "วันเกิดมีอะไรให้มั๊ย",
    "มีโปรวันเกิดมั๊ย",
    "เกิดวันนี้ได้อะไร",
    "งานวันเกิดผมแจก500จริงป่าวครับ",
    "งานวันเกิดผมแจก500จริงป่าวคะ",
    "มีโปรวันเกิดมั้ยค่ะ",
    "มีโปรวันเกิดมั้ยครับ",
    "มีโปรวันเกิดมั้ย"
  ];
  const flexProBirthday ={
    type: 'flex',
    altText: 'ProBirthday',
    contents:
    {
      "type": "carousel",
      "contents": [
        {
          "type": "bubble",
          "size": "mega",
          "body": {
            "type": "box",
            "layout": "vertical",
            "contents": [
              {
                "type": "image",
                "url": "https://lh3.googleusercontent.com/d/13f6d0DXncKbEeFOgyN0dnq6FUlncEHCm",
                "size": "full",
                "aspectMode": "cover",
                "aspectRatio": "1:1"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "text",
                    "text": "โปรวันเกิด",
                    "color": "#ffffff",
                    "align": "center",
                    "size": "md",
                    "offsetTop": "3px"
                  }
                ],
                "position": "absolute",
                "cornerRadius": "20px",
                "offsetTop": "18px",
                "backgroundColor": "#ff9d00",
                "offsetStart": "18px",
                "height": "30px",
                "width": "80px"
              }
            ],
            "paddingAll": "0px"
          }
        },
        {
          "type": "bubble",
          "size": "mega",
          "body": {
            "type": "box",
            "layout": "vertical",
            "contents": [
              {
                "type": "image",
                "url": "https://lh3.googleusercontent.com/d/1ecFlQnb24X6piLvMmBH8WuWnihT2lrft",
                "size": "full",
                "aspectMode": "cover",
                "aspectRatio": "1:1"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "text",
                    "text": "วิธีรับโปร",
                    "color": "#ffffff",
                    "align": "center",
                    "size": "md",
                    "offsetTop": "3px"
                  }
                ],
                "position": "absolute",
                "cornerRadius": "20px",
                "offsetTop": "18px",
                "backgroundColor": "#ff9d00",
                "offsetStart": "18px",
                "height": "30px",
                "width": "80px"
              }
            ],
            "paddingAll": "0px"
          }
        }
      ]
    }
  }
  const textProBirthday = {
    type: 'text',
    text: `🎂 หากคุณพี่สนใจโปรโมชั่นวันเกิด 🎂

🚩 เพียงฝาก 500 บ. เพื่อรับโบนัสอีก 500 บ.
🚩 ทำเทิร์นกีฬา 10 เท่า รวมโบนัสถอน
🚩 ทำเทิร์นคาสิโน 20 เท่า รวมโบนัสถอน
    
⚡ เพียงส่งภาพบัตรประชาชน เพื่อยืนยันรับโปรวันเกิด`
  };

  // โปรโมชั่นมวย
  let stateProBoxing = [
    "โปรโมชั่นมวย",
    "โปรมวย",
    "มีโปรมวยมั๊ย",
    "เล่นมวยมีโปรอะไร",
    "มวยมีโปรอะไร",
    "โปรมวย10%",
    "โปรมวย 10%"
  ];
  const flexProBoxing ={
    type: 'flex',
    altText: 'ProBoxing',
    contents:
    {
      "type": "carousel",
      "contents": [
        {
          "type": "bubble",
          "size": "mega",
          "body": {
            "type": "box",
            "layout": "vertical",
            "contents": [
              {
                "type": "image",
                "url": "https://lh3.googleusercontent.com/d/1t3kUQHVN6LkuhUX18nQlfuJI-EY3EM3q",
                "size": "full",
                "aspectMode": "cover",
                "aspectRatio": "1:1"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "text",
                    "text": "โปรมวย",
                    "color": "#ffffff",
                    "align": "center",
                    "size": "md",
                    "offsetTop": "3px"
                  }
                ],
                "position": "absolute",
                "cornerRadius": "20px",
                "offsetTop": "18px",
                "backgroundColor": "#ff9d00",
                "offsetStart": "18px",
                "height": "30px",
                "width": "63px"
              }
            ],
            "paddingAll": "0px"
          }
        },
        {
          "type": "bubble",
          "size": "mega",
          "body": {
            "type": "box",
            "layout": "vertical",
            "contents": [
              {
                "type": "image",
                "url": "https://lh3.googleusercontent.com/d/1ecFlQnb24X6piLvMmBH8WuWnihT2lrft",
                "size": "full",
                "aspectMode": "cover",
                "aspectRatio": "1:1"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "text",
                    "text": "วิธีรับโปร",
                    "color": "#ffffff",
                    "align": "center",
                    "size": "md",
                    "offsetTop": "3px"
                  }
                ],
                "position": "absolute",
                "cornerRadius": "20px",
                "offsetTop": "18px",
                "backgroundColor": "#ff9d00",
                "offsetStart": "18px",
                "height": "30px",
                "width": "80px"
              }
            ],
            "paddingAll": "0px"
          }
        }
      ]
    }
  }
  const textProBoxing = {
    type: 'text',
    text: `🥊 หากคุณพี่สนใจโปรโมชั่นกีฬามวย 🥊 

🚩 เพียงฝากขั้นต่ำ 100 บาท 
🚩 ทำเทิร์นมวย  1% โบนัสสุงสุด 100 บ.
   
👆 สามารถดูขั้นตอน การรับโปรโมชั่น ได้ตามภาพด้านบนเลยค่ะ 
   
⭕ หากติดปัญหา แจ้งแอดมินให้แก้ไข ได้เลยทันที`
  };

  // โปรกีฬา
  let stateProSport = [
    "โปรกีฬา",
    "มีโปรกีฬามั๊ย",
    "โปรบอล",
    "มีโปรแทงบอลมั๊ย",
    "โปรแทงบอล",
    "โปรโมชั่นกีฬา",
    "โปรโมชั่นกีฬา5%",
    "โปรกีฬา5%"
  ];
  const flexProSport ={
    type: 'flex',
    altText: 'ProSport',
    contents:
    {
      "type": "carousel",
      "contents": [
        {
          "type": "bubble",
          "size": "mega",
          "body": {
            "type": "box",
            "layout": "vertical",
            "contents": [
              {
                "type": "image",
                "url": "https://lh3.googleusercontent.com/d/1fPJrQNgnLYmJ7gThWUqx35XyPBbfKABP",
                "size": "full",
                "aspectMode": "cover",
                "aspectRatio": "1:1"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "text",
                    "text": "โปรกีฬา",
                    "color": "#ffffff",
                    "align": "center",
                    "size": "md",
                    "offsetTop": "3px"
                  }
                ],
                "position": "absolute",
                "cornerRadius": "20px",
                "offsetTop": "18px",
                "backgroundColor": "#ff9d00",
                "offsetStart": "18px",
                "height": "30px",
                "width": "63px"
              }
            ],
            "paddingAll": "0px"
          }
        },
        {
          "type": "bubble",
          "size": "mega",
          "body": {
            "type": "box",
            "layout": "vertical",
            "contents": [
              {
                "type": "image",
                "url": "https://lh3.googleusercontent.com/d/1ecFlQnb24X6piLvMmBH8WuWnihT2lrft",
                "size": "full",
                "aspectMode": "cover",
                "aspectRatio": "1:1"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "text",
                    "text": "วิธีรับโปร",
                    "color": "#ffffff",
                    "align": "center",
                    "size": "md",
                    "offsetTop": "3px"
                  }
                ],
                "position": "absolute",
                "cornerRadius": "20px",
                "offsetTop": "18px",
                "backgroundColor": "#ff9d00",
                "offsetStart": "18px",
                "height": "30px",
                "width": "80px"
              }
            ],
            "paddingAll": "0px"
          }
        }
      ]
    }
  }
  const textProSport = {
    type: 'text',
    text: `⚽ หากคุณพี่สนใจโปรโมชั่นกีฬา5% ⚽

🚩 เพียงฝากขั้นต่ำ 100 บาท 
🚩 ทำเทิร์นกีฬา 3 เท่า โบนัสสุงสุด 150 บ.
   
👆 สามารถดูขั้นตอนการรับโปรโมชั่น ได้ตามภาพด้านบนเลยค่ะ 
   
⭕ หากติดปัญหาแจ้งแอดมิน ให้แก้ไขได้เลยทันที`
  };
  // ฝากรับสูตร
  let stateDepositFormula = [
    "ฝากรับสูตร",
    "สมัครรับสูตร",
    "สูตร",
    "รับสูตร",
    "ขอสูตร",
    "สูตรสล็อต",
    "สูตรบา",
    "สูตรบาคาร่า",
    "สล็อต",
    "บาคาร่า",
    "โปรโมชั่นฝากรับสูตร",
    "สนใจรับสูตร",
    "รับฟรีสูตรสแกน",
    "รับฟรีสูตรสแกนค่ะ",
    "รับฟรีสูตรสแกนคับ",
    "รับฟรีสูตรสแกนครับ",
    "รับฟรีสูตรสแกนคะ",
    "สูตรสแกน",
    "ขอรับสูตร",
    "ขอรับสูตรค่ะ",
    "ขอรับสูตรคะ",
    "ขอรับสูตรครับ",
    "ขอรับสูตรคับ",
    "รับสูตรสล็อตตรงไหน",
    "รับสูตรสล็อตตรงไหนคะ",
    "รับสูตรสล็อตตรงไหนค่ะ",
    "รับสูตรสล็อตตรงไหนคับ",
    "รับสูตรสล็อตตรงไหนครับ"
  ];

  const flexDepositFormula ={
    type: 'flex',
    altText: 'DepositFormula',
    contents:
    {
      "type": "bubble",
      "size": "giga",
      "body": {
        "type": "box",
        "layout": "vertical",
        "contents": [
          {
            "type": "image",
            "url": "https://lh3.googleusercontent.com/d/1vzy_DN65hseIWq6An-DcY0r_alWLOa9b",
            "size": "full",
            "aspectMode": "cover",
            "aspectRatio": "1:1",
            "gravity": "center"
          }
        ],
        "paddingAll": "0px"
      }
    }
  }

  const textDepositFormula = {
    type: 'text',
    text: `🥳 ฝาก 100 แจ้งรับสูตรได้เลยนะคะ 
📌 ฝากแล้ว รบกวนแจ้งสลิป และแจ้งสูตรที่ต้องการได้เลยค่ะ
    เช่น สูตรสล็อต , สูตรบาคาร่า , สูตรกีฬา`
  };

  // วิธีเล่นรูเล็ต
  let statePlayRoulette = [
    "รูเล็ต",
    "รููเล็ตเดิมพันขั้นต่ำกี่บาท",
    "รูเล็ตจ่ายสูงสุดกี่บาท",
    "เล่นรูเล็ต",
    "วิธีเล่นรูเล็ต"
  ]
  const flexPlayRoulette ={
    type: 'flex',
    altText: 'PlayDice',
    contents:
    {
      "type": "bubble",
      "size": "giga",
      "body": {
        "type": "box",
        "layout": "vertical",
        "contents": [
          {
            "type": "image",
            "url": "https://lh3.googleusercontent.com/d/1STkAl5efGjfabHym30G50Z8xYodXlJbt",
            "size": "full",
            "aspectMode": "cover",
            "aspectRatio": "1:2",
            "gravity": "center"
          }
        ],
        "paddingAll": "0px"
      }
    }
  }
  const flexPlayRoulette1 ={
    type: 'flex',
    altText: 'PlayDice1',
    contents:
    {
      "type": "bubble",
      "size": "giga",
      "body": {
        "type": "box",
        "layout": "vertical",
        "contents": [
          {
            "type": "image",
            "url": "https://lh3.googleusercontent.com/d/1j-pKJEqwf2i6UHl2Dk6UD5I1Z_hMKQoE",
            "size": "full",
            "aspectMode": "cover",
            "aspectRatio": "1:2",
            "gravity": "center"
          }
        ],
        "paddingAll": "0px"
      }
    }
  }
  const textPlayRoulette = {
    type: 'text',
    text: `🚩 คุณพี่ดูวิธีการเล่นรูเล็ต ได้ตามภาพเลยนะคะ 
📲 หากสงสัยสามารถตามแอดมินได้ตลอด 24 ชั่วโมง`
  };

  // วิธีเล่นไฮโล
  let statePlayDice = [
    "ไฮโล",
    "เล่นไฮโลยังไง",
    "ไฮโลจ่ายสูงสุดกี่บาท",
    "ไฮโลเดิมพันขั้นต่ำกี่บาท",
    "วิธีเล่นไฮโล"
  ]
  const flexPlayDice ={
    type: 'flex',
    altText: 'PlayDice',
    contents:
    {
      "type": "bubble",
      "size": "giga",
      "body": {
        "type": "box",
        "layout": "vertical",
        "contents": [
          {
            "type": "image",
            "url": "https://lh3.googleusercontent.com/d/1Q6hKGZTR4wOPux3DlXmHntmKyJtOZ2Ik",
            "size": "full",
            "aspectMode": "cover",
            "aspectRatio": "1:1.72",
            "gravity": "center"
          }
        ],
        "paddingAll": "0px"
      }
    }
  }
  const flexPlayDice1 ={
    type: 'flex',
    altText: 'PlayDice1',
    contents:
    {
      "type": "bubble",
      "size": "giga",
      "body": {
        "type": "box",
        "layout": "vertical",
        "contents": [
          {
            "type": "image",
            "url": "https://lh3.googleusercontent.com/d/1g_D4mBilv-XWs0-zpUWtzI5E_GKNM7A2",
            "size": "full",
            "aspectMode": "cover",
            "aspectRatio": "1:1.72",
            "gravity": "center"
          }
        ],
        "paddingAll": "0px"
      }
    }
  }
  const textPlayDice = {
    type: 'text',
    text: `🚩 คุณพี่ดูวิธีการเล่นไฮโล ได้ตามภาพเลยนะคะ 
📲 หากสงสัยสามารถตามแอดมินได้ตลอด 24 ชั่วโมง`
  };

  // วิธีปรับเบทสล็อต
  let stateChangBetSlot = [
    "วิธีปรับเบทสล็อต",
    "ปรับเบทยังไง",
    "สล็อตปรับเบท",
    "กดเบท20ยังไง"
  ];
  const flexChangeBetSlot ={
    type: 'flex',
    altText: 'ChangeBetSlot',
    contents:
    {
      "type": "bubble",
      "size": "giga",
      "body": {
        "type": "box",
        "layout": "vertical",
        "contents": [
          {
            "type": "image",
            "url": "https://lh3.googleusercontent.com/d/1MY6vScR60aezNb7jQG5VCdLR0TKYqTAc",
            "size": "full",
            "aspectMode": "cover",
            "aspectRatio": "1:1",
            "gravity": "center"
          }
        ],
        "paddingAll": "0px"
      }
    }
  }
  const textChangeBetSlot = {
    type: 'text',
    text: `🥳 คุณพี่ดูตามขั้นตอน การปรับเบทสล็อตในภาพได้เลยค่ะ 
⭐ หากสงสัย สามารถสอบถามแอดมินได้เลยตลอด 24 ชั่วโมง`
  };

  // วิธีการซื้อฟรีสปิน
  let stateBuyFreeSpin = [
    "วิธีการซื้อฟรีสปิน",
    "ฟรีสปิน",
    "ซื้อฟรีสปิน",
    "ซื้อฟรีสปินยังไง",
    "ซื้อฟีเจอร์ยังไง",
    "ซื้อฟีเจอร์"
  ];
  const flexBuyFreeSpin ={
    type: 'flex',
    altText: 'buy free spin',
    contents:
    {
      "type": "bubble",
      "size": "giga",
      "body": {
        "type": "box",
        "layout": "vertical",
        "contents": [
          {
            "type": "image",
            "url": "https://lh3.googleusercontent.com/d/174d2ypq_7oCttNRKeHHU5eSOHr8aRdFv",
            "size": "full",
            "aspectMode": "cover",
            "aspectRatio": "1:1",
            "gravity": "center"
          }
        ],
        "paddingAll": "0px"
      }
    }
  }
  const textBuyFreeSpin = {
    type: 'text',
    text: `🎰 คุณพี่สามารถดูวิธีการซื้อฟรีสปิน ได้ตามภาพด้านบนเลยค่ะ
😻 หากสงสัยตรงไหนเพิ่มเติม ทักแอดมินได้เลยทันที ขอบคุณค่ะ`
  };

  // เล่นบาคาร่าสายฟ้า
  let stateBaccaratThunder = [
    "วิธีเล่นบาคาร่าสายฟ้า",
    "บาคาร่าสายฟ้าเล่นยังไง",
    "บาคาร่าสายฟ้าเดิมพันขั้นต่ำกี่",
    "บาคาร่าสายฟ้า",
    "บาสายฟ้า"
  ];
  const flexBaccaratThunder ={
    type: 'flex',
    altText: 'baccarat thunder',
    contents:
    {
      "type": "bubble",
      "size": "giga",
      "body": {
        "type": "box",
        "layout": "vertical",
        "contents": [
          {
            "type": "image",
            "url": "https://lh3.googleusercontent.com/d/1JEoUdQ1xdFDHw_RapXz_fEbJW8-52qru",
            "size": "full",
            "aspectMode": "cover",
            "aspectRatio": "1:1.72",
            "gravity": "center"
          }
        ],
        "paddingAll": "0px"
      }
    }
  }
  const textBaccaratThunder = {
    type: 'text',
    text: `⚡ คุณพี่สามารถดูวิธีการเล่น บาคาร่าสายฟ้า ได้ตามภาพด้านบนเลยค่ะ 
💛 หากสงสัยตรงไหนเพิ่มเติม ทักแอดมินได้เลยทันที ขอบคุณค่ะ`
  };

  // วิธีเล่นบาคาร่าวัว
  let stateBaccaratCow = [
    "วิธีเล่นบาคาร่าวัว",
    "บาคาร่าวัววัว",
    "บาวัววัว",
    "เล่นบาคาร่าวัววัว",
    "บาคาร่าวัววัวเล่นยังไง",
    "บาคาร่าวัววัวคืออะไร",
    "บาคาร่าวัว วัว เล่นยังไง",
    "บาคาร่า วัว วัว เดินพันขั้นต่ำ"
  ];
  const flexBaccaratCow ={
    type: 'flex',
    altText: 'baccarat cow',
    contents:
    {
      "type": "bubble",
      "size": "giga",
      "body": {
        "type": "box",
        "layout": "vertical",
        "contents": [
          {
            "type": "image",
            "url": "https://lh3.googleusercontent.com/d/1bE-gGOr8PvB_jVSlvbKCIlwLlG6_jxBW",
            "size": "full",
            "aspectMode": "cover",
            "aspectRatio": "1:1.72",
            "gravity": "center"
          }
        ],
        "paddingAll": "0px"
      }
    }
  }
  const textBaccaratCow = {
    type: 'text',
    text: `🐄 คุณพี่สามารถดูวิธีการเล่น บาคาร่า วัววัว ได้ตามภาพด้านบนเลยค่ะ 
💛 หากสงสัยตรงไหนเพิ่มเติม ทักแอดมินได้เลยทันที ขอบคุณค่ะ`
  };

  // วิธีปรับค่าคอมบาคาร่า
  let stateComBaccarat = [
    "ปรับค่าคอมบาคาร่า",
    "บาค่าร่าเล่นแบบไม่มีค่าคอมเป็น",
    "เล่นบาแบบไม่มีค่าคอม",
    "ปรับค่าคอมบา",
    "วิธีปรับค่าคอมบาคาร่า"
  ];
  const flexComBaccarat ={
    type: 'flex',
    altText: 'com baccarat',
    contents:
    {
      "type": "bubble",
      "size": "giga",
      "body": {
        "type": "box",
        "layout": "vertical",
        "contents": [
          {
            "type": "image",
            "url": "https://lh3.googleusercontent.com/d/1PkCeq5Hc-Jdhj3cqH9LIXT6LdZXCZ34G",
            "size": "full",
            "aspectMode": "cover",
            "aspectRatio": "1:1",
            "gravity": "center"
          }
        ],
        "paddingAll": "0px"
      }
    }
  }
  const textComBaccarat = {
    type: 'text',
    text: `💥 คุณพี่กดปิดคำว่าคอมมิชชั่น บนแถบการแทงบาคาร่าตามภาพด้านบนได้เลยค่ะ`
  };


  // วิธีแทงมวย
  let statePlayBoxing = [
    "วิธีแทงมวย",
    "มวย",
    "แทงมวย"
  ];
  const flexPlayBoxing ={
    type: 'flex',
    altText: 'boxing',
    contents:
    {
      "type": "bubble",
      "size": "giga",
      "body": {
        "type": "box",
        "layout": "vertical",
        "contents": [
          {
            "type": "image",
            "url": "https://lh3.googleusercontent.com/d/17ChmnDQzKHVUMNimlCmdZ9BopGWfqPzY",
            "size": "full",
            "aspectMode": "cover",
            "aspectRatio": "1:2",
            "gravity": "center"
          }
        ],
        "paddingAll": "0px"
      }
    }
  }
  const textPlayBoxing = {
    type: 'text',
    text: `😎 คุณพี่ดูขั้นตอน การแทงมวยได้ตามภาพเลยนะคะ 
📲 หากสงสัย สามารถตามแอดมินได้ตลอด 24 ชั่วโมง`
  };

  // แนะนำค่ายบอล
  let stateBallCamp = [
    "แนะนำค่ายบอล",
    "ค่ายไหนน้ำเยอะ",
    "ค่ายไหนค่าน้ำเยอะสุด"
  ];
  const flexBallCamp ={
    type: 'flex',
    altText: 'ball camp',
    contents:
    {
      "type": "bubble",
      "size": "giga",
      "body": {
        "type": "box",
        "layout": "vertical",
        "contents": [
          {
            "type": "image",
            "url": "https://lh3.googleusercontent.com/d/1jP30h3r8AS209QhwztOCGJD0lqXazLhE",
            "size": "full",
            "aspectMode": "cover",
            "aspectRatio": "1:2",
            "gravity": "center"
          }
        ],
        "paddingAll": "0px"
      }
    }
  }

  const textBallCamp = {
    type: 'text',
    text: `📌 แอดมินขอแนะนำ 2 ค่ายนี้ที่ให้ค่าน้ำเยอะนะคะ 
💜 คุณพี่สามารถเลือกจากข้อดี-ข้อเสีย ที่ทำให้คุณพี่พึงพอใจได้เลยค่ะ`
  };


  // วิธีดูบอลสเต็ป
  let stateBallStep = [
    "วิธีดูบอลสเต็ป",
    "ดูบอลสเต็ป",
    "บอลสเต็ป",
    "สเต็ปบอล",
    "แทงบอลสเต็ป",
    "แทงบอลสต็ปตรงไหน",
    "วิธีแทงบอลสเต็ป"
  ];
  const flexBallStep ={
    type: 'flex',
    altText: 'ball step',
    contents:
    {
      "type": "bubble",
      "size": "giga",
      "body": {
        "type": "box",
        "layout": "vertical",
        "contents": [
          {
            "type": "image",
            "url": "https://lh3.googleusercontent.com/d/186Mb7pjlhqRNxPs3T82VtaP9qhvlRTMF",
            "size": "full",
            "aspectMode": "cover",
            "aspectRatio": "1:1",
            "gravity": "center"
          }
        ],
        "paddingAll": "0px"
      }
    }
  }

  const textBallStep = {
    type: 'text',
    text: `⚡ คุณพี่สามารถทำตามขั้นตอน การแทงบอลสเต็ปได้เลยนะคะ
⚡ หากสงสัย สามารถสอบถามแอดมินได้ตลอด 24 ชั่วโมงเลยค่ะ`
  };

  // วิธีดูบิลบอล
  let stateCheckBillBall = [
    "วิธีดูบิลบอล",
    "ดูบิลบอล",
    "บิลบอล",
    "บิลบอลดูยังไง",
    "ดูบิล",
    "บิลบอลหายทำยังไง",
    "เช็คตั๋ว"
  ];

  const flexCheckBillBall ={
    type: 'flex',
    altText: 'check bill ball',
    contents:
    {
      "type": "bubble",
      "size": "giga",
      "body": {
        "type": "box",
        "layout": "vertical",
        "contents": [
          {
            "type": "image",
            "url": "https://lh3.googleusercontent.com/d/1Fx0gmd6IeULtTWGWjoZIOhlwASmBQCwy",
            "size": "full",
            "aspectMode": "cover",
            "aspectRatio": "1:1",
            "gravity": "center"
          }
        ],
        "paddingAll": "0px"
      }
    }
  }

  const textCheckBillBall = {
    type: 'text',
    text: `👆 คุณพี่ ดูวิธีการดูบิลบอลตามภาพได้เลยค่ะ 👆
🎈 หากติดปัญหาไม่สามารถดูบิลบอลได้ ให้แจ้งแอดมินได้ตลอด 24 ชั่วโมง`
  };

  // วิธีแทงบอล
  let statePlayBall = [
    "วิธีแทงบอล",
    "แทงบอล",
    "แทงบอลยังไง",
    "อยากแทงบอล",
    "แทงบอลสโบ",
    "กีฬา"
  ];
  const flexPlayBall ={
    type: 'flex',
    altText: 'play ball',
    contents:
    {
      "type": "bubble",
      "size": "giga",
      "body": {
        "type": "box",
        "layout": "vertical",
        "contents": [
          {
            "type": "image",
            "url": "https://lh3.googleusercontent.com/d/1Wd2wAGZpLg8HZE0MMqi80RlGg1dRjKmq",
            "size": "full",
            "aspectMode": "cover",
            "aspectRatio": "1:2",
            "gravity": "center"
          }
        ],
        "paddingAll": "0px"
      }
    }
  }

  const textPlayBall = {
    type: 'text',
    text: `🎉 ดูวิธีแทงบอลได้ตามภาพเลยนะคะ 
📱  หากสงสัย และต้องการสอบถามเพิ่มเติม 
😍 ทักแอดมินได้ตลอด 24 ชั่วโมงเลยค่ะ`
  };

  // โหลดแอปลงหน้าโฮม
  let stateAppHome = [
    "แอป",
    "มีแอปมั๊ย",
    "เพิ่มแอป",
    "ติดตั้งแอป",
    "มีแอฟป่าวครับ",
    "มีแอฟป่าวค่ะ",
    "มีแอฟมั๊ย",
    "โหลดแอปลงหน้าโฮมยังไง",
    "โหลดแอปลงหน้าโฮมยังไงคะ",
    "โหลดแอปลงหน้าโฮมยังไงค่ะ",
    "โหลดแอปลงหน้าโฮมยังไงคับ",
    "โหลดแอปลงหน้าโฮมยังไงครับ"
  ];
  const flexAppHome ={
    type: 'flex',
    altText: 'app',
    contents:
    {
      "type": "bubble",
      "size": "giga",
      "body": {
        "type": "box",
        "layout": "vertical",
        "contents": [
          {
            "type": "image",
            "url": "https://lh3.googleusercontent.com/d/1yIZJ2KVvqDTEQ0ad5cdjaIzkz-zGW2o2",
            "size": "full",
            "aspectMode": "cover",
            "aspectRatio": "1:1",
            "gravity": "center"
          }
        ],
        "paddingAll": "0px"
      }
    }
  }

  const textAppHome = {
    type: 'text',
    text: `👆 คุณพี่สามารถดูขั้นตอน การเพิ่มแอปให้อยู่หน้าโฮม ได้ตามภาพด้านบนเลยค่ะ 

⭕ หากติดปัญหา แจ้งแอดมินให้แก้ไข ได้เลยทันที`
  };

  // ปรับยอดเดิมพันเพิ่มไม่ได้
  let stateNotChangeBet = [
    "ปรับยอดเดิมพันเพิ่มไม่ได้",
    "ปรับยอดเดิมพัน",
    "เพิ่มยอดเดิมพัน",
  ];

  const textNotChangeBet = {
    type: 'text',
    text: `⭐ ไม่ทราบว่าคุณพี่ ต้องการปรับยอดเดิมพันของเกมไหนดีคะ 
◾ สล็อต
◾ คาสิโน
◾ บอล 
◾ มวย
👩‍🦰 แจ้งเกม และวงเงินที่ต้องการให้ปรับได้เลยค่ะ`
  };

  // เปลี่ยนภาษายังไง
  let stateChangeLanguage = [
    "เปลี่ยนภาษา",
    "เปลี่ยนภาษายังไง",
    "ขั้นตอนเปลี่ยนภาษา",
    "เปลี่ยนภาษาทำยังไง",
    "อยากเปลี่ยนภาษา",
    "มีเปลี่ยนภาษามั๊ย",
    "เปลี่ยนภาษาตรงไหน",
    "ภาษา",
    "เปลี่ยนภาษาไทย",
    "จะเปลี่ยนเป็นภาษาไทยยังไง"
  ];
  const flexChangeLanguage ={
    type: 'flex',
    altText: 'language',
    contents:
    {
      "type": "bubble",
      "size": "giga",
      "body": {
        "type": "box",
        "layout": "vertical",
        "contents": [
          {
            "type": "image",
            "url": "https://lh3.googleusercontent.com/d/1PVTvdhJJH3qyxW1tr6x3njgOErMARJT-",
            "size": "full",
            "aspectMode": "cover",
            "aspectRatio": "1:1",
            "gravity": "center"
          }
        ],
        "paddingAll": "0px"
      }
    }
  }

  const textChangeLanguage = {
    type: 'text',
    text: `👆  คุณพี่สามารถดูขั้นตอนการเปลี่ยนภาษา ได้ตามภาพด้านบนเลยค่ะ

😍 หากสงสัยตรงไหน หรือติดปัญหาเพิ่มเติม ทักแอดมินได้เลยทันที ขอบคุณค่ะ`
  };

  // จำยูสไม่ได้
  let stateNotRememberUser =[
    "จำยูสไม่ได้",
    "จำยูสไม่ได้ครับ",
    "จำยูสไม่ได้ค่ะ",
    "จำยูสไม่ได้คะ",
    "จำuserไม่ได้ครับ",
    "จำuserไม่ได้คับ",
    "จำ user ไม่ได้",
    "จำ user ไม่ได้ค่ะ",
    "จำ user ไม่ได้คะ",
    "จำ user ไม่ได้คับ",
    "จำ user ไม่ได้ครับ",
    "จำยูสไม่ได้คับ",
    "จำuserไม่ได้",
    "จำuserไม่ได้ค่ะ",
    "จำuserไม่ได้คะ",
  ];
  const textNotRememberUser = {
    type: 'text',
    text: `🧨 รบกวนคุณพี่แจ้งข้อมูลสมาชิกดังนี้
◾ ชื่อ-นามสกุล 
◾ เบอร์โทร 
◾ เลขบัญชีธนาคาร 
👩‍🦰 แจ้งแล้ว รอน้องแอดมิน ทำรายงานตรวจสอบให้สักครู่นะคะ`
  };

  // ต้องการเปลี่ยนเบอร์โทร
  let stateChangePhone = [
    "ต้องการเปลี่ยนเบอร์โทร",
    "เปลี่ยนเบอร์ได้ไหม",
    "เปลี่ยนเบอร์",
    "จะเปลี่ยนเบอร์",
    "อยากเปลี่ยนเบอร์โทร",
    "อยากเปลี่ยนเบอร์",
    "ต้องการเปลี่ยนเบอร์โทรค่ะ",
    "ต้องการเปลี่ยนเบอร์โทรคะ",
    "ต้องการเปลี่ยนเบอร์โทรคับ",
    "ต้องการเปลี่ยนเบอร์โทรครับ",
    "เปลี่ยนเบอร์ได้ไหมค่ะ",
    "เปลี่ยนเบอร์ได้ไหมคะ",
    "เปลี่ยนเบอร์ได้ไหมคับ",
    "เปลี่ยนเบอร์ได้ไหมครับ",
    "เปลี่ยนเบอร์ค่ะ",
    "เปลี่ยนเบอร์คะ",
    "เปลี่ยนเบอร์คับ",
    "เปลี่ยนเบอร์ครับ",
    "อยากเปลี่ยนเบอร์โทรค่ะ",
    "อยากเปลี่ยนเบอร์โทรคะ",
    "อยากเปลี่ยนเบอร์โทรคับ",
    "อยากเปลี่ยนเบอร์โทรครับ",
    "อยากเปลี่ยนเบอร์ค่ะ",
    "อยากเปลี่ยนเบอร์คะ",
    "อยากเปลี่ยนเบอร์คับ",
    "อยากเปลี่ยนเบอร์ครับ"
  ];
  const textChangePhone = {
    type: 'text',
    text: `📞 รบกวนคุณพี่แจ้งข้อมูลดังนี้
◾ เบอร์เก่าที่ใช้สมัคร 
◾ เบอร์ใหม่ที่ต้องการเปลี่ยน
👩‍🦰 แจ้งแล้ว รอน้องแอดมิน ดำเนินการให้สักครู่นะคะ`
  };

  // ลืมรหัสผ่าน
  let stateForgetPassword = [
    "จำรหัสผ่าน​ไม่ได้",
    "ลืมรหัสผ่าน",
    "ลืมรหัส",
    "จำรหัสผ่าน​ไม่ได้ค่ะ",
    "จำรหัสผ่าน​ไม่ได้ครับ",
    "ลืมรหัสผ่านค่ะ",
    "ลืมรหัสผ่านครับ",
    "ขอUser หน่อยค่ะ",
    "ขอUser หน่อยคะ",
    "ขอUser หน่อย",
    "ขอUser หน่อยคับ",
    "ขอUser หน่อยครับ",
    "ขอยูสหน่อย",
    "ขอยูสหน่อยค่ะ",
    "ขอยูสหน่อยคะ",
    "ขอยูสหน่อยครับ",
    "ขอยูสหน่อยคับ",
  ];
  const textForgetPassword = {
    type: 'text',
    text: `🚨 กรณีลืม USER ( รหัสผู้ใช้งาน ) หรือ PASSWORD ( รหัสผ่าน ) แจ้งข้อมูลดังนี้

1. ชื่อ - นามสกุล :
2. เลขบัญชี :
3. ธนาคาร :
4. เบอร์โทรศัพท์ :
5. ไอดีไลน์ :
    
🚫 ทางเว็บจะเก็บข้อมูลของคุณพี่เป็นความลับขั้นสูงสุดอย่างแน่นอนค่ะ`
  };


  // เข้าเว็บไม่ได้ วิธีเข้าเล่น
  let stateNotEnterWeb = [
    "เข้าเล่นไม่ได้",
    "เข้าเล่นยังไง",
    "ทำไมเข้าไม่ได้",
    "เข้าเล่น",
    "ทางเข้าเล่น",
    "เข้าไม่ได้",
    "เข้าเว็บไม่ได้",
    "เว็บเข้าไม่ได้",
    "ระบบเข้าไม่ได้หรอคะ",
    "ระบบเข้าไม่ได้หรอครับ",
    "ระบบเข้าไม่ได้ค่ะ",
    "ระบบเข้าไม่ได้ครับ",
    "ระบบเข้าไม่ได้",
    "ขอลิงค์",
    "ลิงค์",
    "ทำไมเข้าหน้าเว็ปไม่ได้ครับ",
    "ทำไมเข้าหน้าเว็ปไม่ได้คะ",
    "ทำไมแอปเข้าไม่ได้ค่ะ",
    "ทำไมแอปเข้าไม่ได้ครับ",
    "เข้าเล่นตรงไหนคะ",
    "เข้าเล่นตรงไหนครับ",
    "ทางเข้า",
    "ทางเข้าครับ",
    "ทางเข้าค่ะ",
    "เว็บเข้าไม่ได้ครับ",
    "เว็บเข้าไม่ได้ค่ะ",
    "เว็บเข้าไม่ได้คะ",
    "จะเข้าเล่น",
    "จะเข้าเล่นครับ",
    "จะเข้าเล่นคับ",
    "จะเข้าเล่นค่ะ",
    "จะเข้าเล่นคะ",
    "เว็บเข้าไม่ได้คับ",
    "จะเข้าเล่นเว็บ",
    "จะเข้าเล่นเว็บครับ",
    "จะเข้าเล่นเว็บคับ",
    "จะเข้าเล่นเว็บคะ",
    "จะเข้าเล่นเว็บค่ะ",
    "เข้าเว็บไม่ได้ค่ะ",
    "เข้าเว็บไม่ได้คะ",
    "เข้าเว็บไม่ได้ครับ",
    "เข้าเว็บไม่ได้คับ",
    "กดเข้าหน้าเว็บไม่ได้",
    "กดเข้าหน้าเว็บไม่ได้ค่ะ",
    "กดเข้าหน้าเว็บไม่ได้ครับ",
    "กดเข้าหน้าเว็บไม่ได้คับ",
    "เข้าหน้าเว็บไม่ได้",
    "เข้าหน้าเว็บไม่ได้ค่ะ",
    "ข้าหน้าเว็บไม่ได้คะ",
    "เข้าหน้าเว็บไม่ได้ครับ",
    "เข้าหน้าเว็บไม่ได้คับ"
  ]
  
  const flexNotEnterWeb ={
    type: 'flex',
    altText: 'withdraw',
    contents:
    {
      "type": "bubble",
      "size": "giga",
      "body": {
        "type": "box",
        "layout": "vertical",
        "contents": [
          {
            "type": "image",
            "url": "https://lh3.googleusercontent.com/d/1nDivcVLSD8prDSrwGEI8v9XBa1y0xtBA",
            "size": "full",
            "aspectMode": "cover",
            "aspectRatio": "1:1",
            "gravity": "center"
          }
        ],
        "paddingAll": "0px"
      }
    }
  }

  const textNotEnterWeb = {
    type: 'text',
    text: `😍 หากคุณพี่เข้าเล่นเว็บไม่ได้ เพียงเอาลิงก์ด้านล่าง

👉 https://heylink.me/sbo360login/
    
🎈 แล้วทำตามภาพได้เลยค่ะ หากยังเข้าเล่นไม่ได้ แคปภาพหน้าจอส่งแจ้งแอดมินได้เลยทันที`
  };

    // ถอนเงินนาน
    let stateLongWithdraw =[
      "ถอนเงินนาน",
      "ถอนนาน",
      "ถอนนานมาก",
      "ถอนนานมากครับ",
      "ถอนนานมากค่ะ",
      "ตรวจสอบ",
      "ถอนเงินนาน (ตรวจสอบ)",
      "ถอนตังยังไม่เข้าเลยครับ",
      "ถอนตังยังไม่เข้าเลยคับ",
      "ถอนตังยังไม่เข้าเลยค่ะ",
      "ถอนตังยังไม่เข้าเลยคะ",
      "ถอนยังไม่เข้าครับ",
      "ถอนยังไม่เข้าคับ",
      "ถอนยังไม่เข้าค่ะ",
      "ถอนยังไม่เข้าคะ",
    ];
    const textLongWithdraw = {
      type: 'text',
      text: `🏧 แอดมินขออภัยในความล่าช้านะคะ 
  👩‍🦰 ตอนนี้ยอดคุณพี่ อยู่ในช่วงการตรวจสอบ 
  🙏 หากรายการเรียบร้อย น้องจะรีบแจ้งให้ทราบทันทีค่ะ`
    };

  // ถอนเงินได้เงินไม่ครบ
  let stateIncompleteWithdraw =[
    "ถอนเงินแล้วได้เงินไม่ครบ",
    "ติดเทิร์น",
    "ถอนเงินไม่ครบ",
    "ทำไมถึงถอนไม่ได้ครับ",
    "กดถอนตังไม่ได้",
    "กดถอนตังไม่ได้ค่ะ",
    "กดถอนตังไม่ได้คะ",
    "กดถอนตังไม่ได้คับ",
    "กดถอนตังไม่ได้ครับ",
    "ทำไมถึงถอนไม่ได้คะ",
    "ทำไมถึงถอนไม่ได้ค่ะ",
    "ทำไมถึงถอนไม่ได้คับ",
    "ถอนไม่สำเร็จ",
    "ถอนไม่สำเร็จค่ะ",
    "ถอนไม่สำเร็จคะ",
    "ถอนไม่สำเร็จคับ",
    "ถอนไม่สำเร็จครับ",
    "ถอนเงินไม่ได้ครับ",
    "ถอนเงินไม่ได้คับ",
    "ถอนเงินไม่ได้ค่ะ",
    "ถอนเงินไม่ได้คะ",
    "แจ้งถอนแต่เงินยังไม่เข้านะคะ",
    "แจ้งถอนแต่เงินยังไม่เข้าค่ะ",
    "แจ้งถอนแต่เงินยังไม่เข้า",
    "ถอนเงินไม่ได้",
    "ถอนไม่เหนเข้าสักที",
    "ถอนไม่เหนเข้าสักทีค่ะ",
    "ถอนไม่เหนเข้าสักทีคะ",
    "ถอนไม่เหนเข้าสักทีคับ",
    "ถอนไม่เหนเข้าสักทีครับ",
    "ถอนไม่เห็นเข้าสักที",
    "ถอนไม่เห็นเข้าสักทีค่ะ",
    "ถอนไม่เห็นเข้าสักทีคะ",
    "ถอนไม่เห็นเข้าสักทีคับ",
    "ถอนไม่เห็นเข้าสักทีครับ"
  ];
  
  const textIncompleteWithdraw = {
    type: 'text',
    text: `👩‍🦰 รบกวนคุณพี่แจ้ง ยูสเซอร์ และ เบอร์โทร เพื่อให้แอดมินตรวจสอบให้หน่อยค่ะ`
  };

  // วิธีการถอนเงิน 
  let stateWithdraw = [
    "วิธีการถอน",
    "ถอนเงิน",
    "ถอน",
    "ถอนค่ะ",
    "ถอนคะ",
    "ถอนครับ",
    "ถอนคับ",
    "ต้องการถอน",
    "ถอนเงินไม่ได้",
    "ถอนเงินยังไง",
    "แจ้งถอนเงิน",
    "กดถอนไม่ได้",
    "กดระบุยอดถอนไม่ได้",
    "ถอนเงินครับ",
    "ถอนเงินค่ะ",
    "ถอนเงินคะ",
    "ถอนค่ะ",
    "ถอนครับ",
    "ถอนเงินหน่อย",
    "ถอนเงินหน่อยค่ะ",
    "ถอนเงินหน่อยคะ",
    "ถอนเงินหน่อยครับ",
    "ถอนเงินหน่อยคับ",
    "ถอนเงินให้หน่อย",
    "ถอนเงินให้หน่อยครับ",
    "ถอนเงินให้หน่อยคับ",
    "ถอนเงินให้หน่อยค่ะ",
    "ถอนเงินให้หน่อยคะ",
    "แจ้งถอน",
    "แจ้งถอนค่ะ",
    "แจ้งถอนคะ",
    "แจ้งถอนคับ",
    "แจ้งถอนครับ",
    "ถอนเงินยังไม่ได้",
    "ถอนเงินยังไม่ได้ค่ะ",
    "ถอนเงินยังไม่ได้คะ",
    "ถอนเงินยังไม่ได้คับ",
    "ถอนเงินยังไม่ได้ครับ",
    "ถอนไม่เข้า",
    "ถอนไม่เข้าค่ะ",
    "ถอนไม่เข้าคะ",
    "ถอนไม่เข้าคับ",
    "ถอนไม่เข้าครับ",
    "ถอนแล้วยอดไม่เข้าครับ",
    "ถอนแล้วยอดไม่เข้าคับ",
    "ถอนแล้วยอดไม่เข้าค่ะ",
    "ถอนแล้วยอดไม่เข้าคะ",
    "วิธีการถอนเงิน",
    "วิธีการถอนเงินครับ",
    "วิธีการถอนเงินคับ",
    "วิธีการถอนเงินค่ะ",
    "วิธีการถอนเงินคะ",
    "วิธีถอนเงิน",
    "ถอนเงินหน่อยครับ",
    "ถอนเงินหน่อยคับ",
    "ถอนเงินหน่อยคะ",
    "ถอนเงินหน่อยค่ะ",
    "ถอนให้หน่อย"
  ]

  const flexWithdraw ={
    type: 'flex',
    altText: 'noDeposite',
    contents:
    {
      "type": "bubble",
      "size": "giga",
      "body": {
        "type": "box",
        "layout": "vertical",
        "contents": [
          {
            "type": "image",
            "url": "https://lh3.googleusercontent.com/d/1E27C1arKah8DkWowSHNYxpH8e1pDi5NH",
            "size": "full",
            "aspectMode": "cover",
            "aspectRatio": "1:1",
            "gravity": "center"
          }
        ],
        "paddingAll": "0px"
      }
    }
  }

  const textWithdraw = {
    type: 'text',
    text: `🤑 หากต้องการถอนเงิน สามารถทำได้ตามภาพเลยค่ะพี่ 

⚠️ ถ้าพี่ยังไม่สามารถถอนเงินได้ รบกวนคุณพี่แจ้งยูสเซอร์ และเบอร์โทร ให้แอดมินดำเนินการได้เลยค่ะ`
  };

  // ฝาก - ถอนขั้นต่ำเท่าไหร่
  let stateMinimalDeposite = [
    "ฝาก - ถอนขั้นต่ำเท่าไหร่",
    "ฝากขั้นต่ำเท่าไหร่",
    "ถอนขั้นต่ำเท่าไหร่",
    "ฝากถอนขั้นต่ำเท่าไหร่ครับ",
    "ฝากถอนขั้นต่ำเท่าไหร่",
    "ฝากถอนขั้นต่ำเท่าไหร่คับ",
    "ฝากถอนขั้นต่ำเท่าไหร่คะ",
    "ฝากถอนขั้นต่ำเท่าไหร่ค่ะ",
    "ฝากถอนขั้นต่ำเท่าไรครับ",
    "ฝากถอนขั้นต่ำเท่าไรคับ",
    "ฝากถอนขั้นต่ำเท่าไรคะ",
    "ฝากถอนขั้นต่ำเท่าไรค่ะ",
    "ฝากถอนขั้นต่ำเท่าไร",
  ];

  const textMinimaDeposite = {
    type: 'text',
    text: `💌 ฝาก - ถอนขั้นต่ำ 1 บาทค่ะ
🚨 แต่ถ้าสนใจรับสูตรสล็อตกับบาคาร่า ฝาก 100 บาท ได้เลยค่ะ`
  };

  // อัปโหลดสลิปไม่ได้
  let stateUploadSlip = [
    "อัปสลิป",
    "อัพสลิปไม่ได้",
    "อัพสลิปยังไง",
    "สลิป",
    "อัปสลิปไม่ได้",
    "กดอัพสลิปตรงไหน",
    "กดอัปสลิปตรงไหน",
    "กดอัปสลิปตรงไหนคับ",
    "กดอัปสลิปตรงไหนครับ",
    "กดอัปสลิปตรงไหนคะ",
    "กดอัปสลิปตรงไหนค่ะ",
    "อัพสลิป",
    "อัพสลีป",
    "อัปโหลดสลิปไม่ได้",
    "อัปโหลดสลิปไม่ได้ครับ",
    "อัปโหลดสลิปไม่ได้ค่ะ",
    "อัปโหลดสลิปไม่ได้คะ",
    "อัปโหลดสลิปไม่ได้คับ",
    "อัปสลิปคับ",
    "อัปสลิปครับ",
    "อัปสลิปค่ะ",
    "อัปสลิปคะ",
    "อัพสลิปไม่ได้ครับ",
    "อัพสลิปไม่ได้ค่ะ",
    "อัพสลิปไม่ได้คับ",
    "อัพสลิปไม่ได้คะ",
    "อัพสลิปยังไงคับ",
    "อัพสลิปยังไงคะ",
    "อัพสลิปยังไงครับ",
    "อัพสลิปยังไงค่ะ",
    "อัปสลิปหน่อย",
    "อัปสลิปหน่อยครับ",
    "อัปสลิปหน่อยค่ะ",
    "อัปสลิปหน่อยคะ",
    "อัปสลิปหน่อยคับ",
    "อัพสลิปหน่อย",
    "อัพสลิปหน่อยครับ",
    "อัพสลิปหน่อยคะ",
    "อัพสลิปหน่อยค่ะ",
    "อัพสลิปหน่อยคับ",
    "อัปสลิปไม่ได้ค่ะ",
    "อัปสลิปไม่ได้ครับ",
    "อัปสลิปไม่ได้คับ",
    "อัปสลิปไม่ได้คะ"
  ];

  const flexUploadSlip ={
    type: 'flex',
    altText: 'noDeposite',
    contents:
    {
      "type": "bubble",
      "size": "giga",
      "body": {
        "type": "box",
        "layout": "vertical",
        "contents": [
          {
            "type": "image",
            "url": "https://lh3.googleusercontent.com/d/1VeNSKuZ0cISo3eyDTsV_aSo9pZhRW2o8",
            "size": "full",
            "aspectMode": "cover",
            "aspectRatio": "1:1.8",
            "gravity": "center"
          }
        ],
        "paddingAll": "0px"
      }
    }
  }

  const textUploadSlip = {
    type: 'text',
    text: `✅ คุณพี่ลองทำตามภาพ วิธีการอัปโหลดสลิปได้เลยค่ะ
👩‍🦰 หากมีข้อสงสัย สามารถทั้งหาน้องแอดมินได้ตลอด 24 ชม.`
  };
  // ฝากเงินไม่เข้า
  let stateNoDeposite = [
    "ฝากเงินไม่เข้า",
    "ฝากแล้วเครดิตไม่เข้า",
    "เงินไม่เข้า",
    "ฝากไม่เข้า",
    "เครดิตไม่เข้า",
    "ฝากเงินไม่เข้าครับ",
    "ฝากยอดแล้วไม่เข้าครับ",
    "ฝากยอดแล้วไม่เข้าคับ",
    "ฝากยอดแล้วไม่เข้าค่ะ",
    "ฝากยอดแล้วไม่เข้าคะ",
    "ตังไม่เข้า",
    "ตังไม่เข้าครับ",
    "ตังไม่เข้าค่ะ",
    "ตังไม่เข้าคะ",
    "ยอดไม่ออโต้",
    "ยอดไม่ออโต้ครับ",
    "ยอดไม่ออโต้คับ",
    "ยอดไม่ออโต้ค่ะ",
    "ยอดไม่ออโต้คะ",
    "ฝากเงินไม่เข้าคับ",
    "ฝากเงินไม่เข้าค่ะ",
    "ฝากเงินไม่เข้าคะ",
    "ฝากแล้วเครดิตไม่เข้าครับ",
    "ฝากแล้วเครดิตไม่เข้าค่ะ",
    "ฝากแล้วเครดิตไม่เข้าคับ",
    "ฝากแล้วเครดิตไม่เข้าคะ",
    "เงินไม่เข้าค่ะ",
    "เงินไม่เข้าคะ",
    "เงินไม่เข้าคับ",
    "เงินไม่เข้าครับ",
    "ฝากไม่เข้าค่ะ",
    "ฝากไม่เข้าคะ",
    "ฝากไม่เข้าครับ",
    "ฝากไม่เข้าคับ",
    "เครดิตไม่เข้าครับ",
    "เครดิตไม่เข้าคับ",
    "เครดิตไม่เข้าค่ะ",
    "เครดิตไม่เข้าคะ",
    "เงินเข้าช้าจัง",
    "เงินเข้าช้าจังค่ะ",
    "เงินเข้าช้าจังคะ",
    "เงินเข้าช้าจังคับ",
    "เงินเข้าช้าจังครับ",
    "ยอดไม่มา",
    "ยอดไม่มาค่ะ",
    "ยอดไม่มาคะ",
    "ยอดไม่มาคับ",
    "ยอดไม่มาครับ",
    "ยอดยังไม่เข้า",
    "ยอดยังไม่เข้าค่ะ",
    "ยอดยังไม่เข้าคะ"
  ];

  const flexNoDeposite = {
    type: 'flex',
    altText: 'noDeposite',
    contents:
    {
      "type": "bubble",
      "size": "giga",
      "body": {
        "type": "box",
        "layout": "vertical",
        "contents": [
          {
            "type": "image",
            "url": "https://lh3.googleusercontent.com/d/1VeNSKuZ0cISo3eyDTsV_aSo9pZhRW2o8",
            "size": "full",
            "aspectMode": "cover",
            "aspectRatio": "1:1.8",
            "gravity": "center"
          }
        ],
        "paddingAll": "0px"
      }
    }
  }

  const textNoDeposite = {
    type: 'text',
    text: `📌 หากคุณพี่ฝากเงินไม่เข้า คุณพี่ลองกดอัปโหลดสลิปตามภาพด้านบนก่อนนะคะ 

⚠️ ถ้าทำตามแล้วยอดเงินยังไม่เข้า รบกวนคุณพี่แจ้งยูสเซอร์ และเบอร์โทร ให้แอดมินดำเนินการได้เลยค่ะ`
  };

  // วิธีการฝากเงิน
  let stateDeposite = [
    "วิธีฝาก",
    "ฝากเงิน",
    "ฝากยังไง",
    "ขอเลขบัญชีฝาก",
    "ฝากเงินหน่อยครับ",
    "ฝากเงินหน่อยค่ะ",
    "ฝาก",
    "ฝากค่ะ",
    "ฝากครับ",
    "ฝากเงินครับ",
    "ฝากเงินค่ะ",
    "ฝากแล้วค่ะ",
    "ฝากแล้วครับ",
    "ฝากเงินหน่อย",
    "ฝาก เงิน",
    "วิธีฝากเงิน",
    "วิธีการฝากเงิน",
    "ฝากได้เลยมั้ยคะ",
    "ฝากได้เลยมั้ย",
    "ฝากได้เลยมั้ยค่ะ",
    "ฝากได้เลยมั้ยครับ",
    "ฝากได้เลยมั้ยคับ",
    "ฝากหน้าเวปเลยได้มั้ย",
    "ฝากหน้าเวปเลยได้มั้ยคะ",
    "ฝากหน้าเวปเลยได้มั้ยค่ะ",
    "ฝากหน้าเวปเลยได้มั้ยคับ",
    "ฝากหน้าเวปเลยได้มั้ยครับ",
    "ฝากหน้าเว็บเลยได้มั้ย",
    "ฝากหน้าเว็บเลยได้มั้ยคะ",
    "ฝากหน้าเว็บเลยได้มั้ยค่ะ",
    "ฝากหน้าเว็บเลยได้มั้ยคับ",
    "ฝากหน้าเว็บเลยได้มั้ยครับ"
  ]

  const flexDeposite = {
    type: 'flex',
    altText: 'deposite',
    contents:
    {
      "type": "bubble",
      "size": "giga",
      "body": {
        "type": "box",
        "layout": "vertical",
        "contents": [
          {
            "type": "image",
            "url": "https://lh3.googleusercontent.com/d/1u2luqdO-hVhpm9C5eAFpgXtyCs2kRjA9",
            "size": "full",
            "aspectMode": "cover",
            "aspectRatio": "1:1",
            "gravity": "center"
          }
        ],
        "paddingAll": "0px"
      }
    }
  }

  const textDeposite = {
    type: 'text',
    text: `✅ คุณพี่ลองทำตามภาพวิธีการฝากได้เลยนะคะ 
⚠️ หากเครดิตยังไม่เข้า รบกวนแจ้งยูสเซอร์ เบอร์โทร และส่งสลิปการโอน เพื่อให้น้องแอดมินช่วยตรวจสอบได้เลยค่ะ`
  };


  // ต้อการให้เราสมัครสมาชิกให้
  let stateRegisterAdmin = [
    "ต้องการให้เราสมัครสมาชิกให้",
    "สมัครไม่ได้ครับ",
    "สมัครไม่ได้ค่ะ",
    "สมัครไม่ได้",
    "สมัครไม่ได้ทำไง",
    "สมัครไม่ได้ทำยังไงครับ",
    "สมัครไม่ได้ทำยังไงคะ",
    "สมัครไม่ได้ทำยังไงค่ะ",
    "สมัครไม่ได้ทำไงครับ",
    "สมัครไม่ได้ทำไงคับ",
    "สมัครไม่ได้คับ",
    "สมัครไม่เห็นได้",
    "สมัครให้หน่อย",
    "สมัครให้หน่อยค่ะ",
    "สมัครให้หน่อยคับ",
    "สมัครให้หน่อยครับ",
    "สมัครให้หน่อยคะ",
    "เเอดสมัครให้หน่อย",
    "เเอดสมัครให้หน่อยค่ะ",
    "เเอดสมัครให้หน่อยคะ",
    "เเอดสมัครให้หน่อยคับ",
    "เเอดสมัครให้หน่อยครับ",
    "แอดสมัครให้หน่อย",
    "แอดสมัครให้หน่อยค่ะ",
    "แอดสมัครให้หน่อยคะ",
    "แอดสมัครให้หน่อยครับ",
    "แอดสมัครให้หน่อยคับ"
  ]

  const textRegisterAdmin = {
    type: 'text',
    text: `
💢 ให้น้องแอดมินสมัครให้นะคะ คุณพี่แจ้งข้อมูลดังนี้
🧡 ชื่อ-นามสกุล
🧡 เบอร์โทรติดต่อ
🧡 เลขบัญชีธนาคารและชื่อธนาคาร
👩‍🦰 เมื่อแจ้งแล้ว น้องแอดมินขอดำเนินการให้สักครู่นะคะ
    `
  };

  // สมัครแล้ว ติดปัญหา
  let stateRegisterProblem = [
    "สมัครแล้ว ติดปัญหา",
    "สมัครแล้วแต่เข้าเล่นไม่ได้",
    "สมัครแล้วแต่เข้าเล่นไม่ได้ค่ะ",
    "สมัครแล้วแต่เข้าเล่นไม่ได้คะ",
    "สมัครแล้วแต่เข้าเล่นไม่ได้ครับ",
    "สมัครแล้วแต่เข้าเล่นไม่ได้คับ",
  ]

  const textRegisterProblem = {
    type: 'text',
    text: "👉 รบกวนคุณพี่แจ้ง ยูสเซอร์ และเบอร์โทรที่สมัคร เพื่อให้น้องตรวจสอบให้เพิ่มเติมค่ะ",
  };


  // register ต้องการสมัครสมาชิกออโต้
  let stateRegisterAuto = [
    "สมัครสมาชิก",
    "ต้องการสมัครสมาชิก",
    "สมัครแล้วขอรับเครดิตฟรี",
    "ต้องการสมัคร",
    "สมัคร",
    "สมัครยังไง",
    "ลิงก์สมัคร",
    "สมัครหน่อยครับ",
    "ขอสมัคร",
    "สมัครค่ะ",
    "สมัครครับ",
    "ต้องการสมัครสมาชิกออโต้",
    "สมัครหน่อย",
    "สมัครหน่อยค่ะ",
    "สมัครคะ",
    "สนใจสมัครครับ",
    "สนใจสมัครค่ะ",
    "สนใจสมัคร",
    "สนใจสมัครคะ",
    "สนใจสมัครหน่อยครับ",
    "สนใจสมัครหน่อยค่ะ",
    "สนใจสมัครหน่อยคะ",
    "สมัค",
    "สมัคครับ",
    "สมัคค่ะ",
    "สมัคคะ"
  ]
  const flexRegisterAuto = {
    type: 'flex',
    altText: 'register',
    contents:
    {
      "type": "bubble",
      "size": "giga",
      "body": {
        "type": "box",
        "layout": "vertical",
        "contents": [
          {
            "type": "image",
            "url": "https://lh3.googleusercontent.com/d/1MPcUj9UiuzqtUsUfxTfXc2LSNU8H8MGj",
            "size": "full",
            "aspectMode": "cover",
            "aspectRatio": "1:1",
            "gravity": "center"
          }
        ],
        "paddingAll": "0px"
      }
    }
  }

  const textRegisterAuto = {
    type: 'text',
    text: "✅ หากคุณพี่ต้องการสมัครเอง กดที่ลิงก์แล้วทำตามภาพได้เลยค่ะ 👇  \n  https://member.sbobet-th.net/register \n \nถ้าอยากให้แอดมินสมัครให้ คุณพี่แจ้งข้อมูลดังนี้     \n🧡 ชื่อ-นามสกุล \n🧡 เบอร์โทรติดต่อ \n🧡 เลขบัญชีธนาคารและชื่อธนาคาร ",
  };


  // test
  const textA = {
    type: 'text',
    text: "สวัสดีค่ะ",
  };

  const textC = {
    type: 'text',
    text: `
    Line 1
    Line 2
    Line 3
    `
  }

  if (event.type == 'message') {
    console.log(event.message.text)

    // if (stateA.includes(event.message.text)) {
    //   return client.replyMessage(event.replyToken,
    //     [planA, textA]
    //   )
    // }


    if (stateGameSuggest.includes(event.message.text)) {
      return client.replyMessage(event.replyToken,
        [flexGameSuggest, textGameSuggest]
      )
    }

    if (stateFriendSuggest.includes(event.message.text)) {
      return client.replyMessage(event.replyToken,
        [flexFriendSuggest, flexFriendSuggest1, textFriendSuggest]
      )
    }

    if (stateProLastUser.includes(event.message.text)) {
      return client.replyMessage(event.replyToken,
        [flexProtLasUser,textProLastUser]
      )
    }

    if (stateReturnLose.includes(event.message.text)) {
      return client.replyMessage(event.replyToken,
        [flexReturnLose,textReturnLose]
      )
    }

    if (stateProBirthday.includes(event.message.text)) {
      return client.replyMessage(event.replyToken,
        [flexProBirthday,textProBirthday]
      )
    }

    if (stateProBoxing.includes(event.message.text)) {
      return client.replyMessage(event.replyToken,
        [flexProBoxing,textProBoxing]
      )
    }

    if (stateProSport.includes(event.message.text)) {
      return client.replyMessage(event.replyToken,
        [flexProSport,textProSport]
      )
    }

    if (stateDepositFormula.includes(event.message.text)) {
      return client.replyMessage(event.replyToken,
        [flexDepositFormula,textDepositFormula]
      )
    }

    if (statePlayRoulette.includes(event.message.text)) {
      return client.replyMessage(event.replyToken,
        [flexPlayRoulette, flexPlayRoulette1,textPlayRoulette]
      )
    }

    if (statePlayDice.includes(event.message.text)) {
      return client.replyMessage(event.replyToken,
        [flexPlayDice, flexPlayDice1,textPlayDice]
      )
    }

    if (stateChangBetSlot.includes(event.message.text)) {
      return client.replyMessage(event.replyToken,
        [flexChangeBetSlot,textChangeBetSlot]
      )
    }

    if (stateBuyFreeSpin.includes(event.message.text)) {
      return client.replyMessage(event.replyToken,
        [flexBuyFreeSpin,textBuyFreeSpin]
      )
    }

    if (stateBaccaratThunder.includes(event.message.text)) {
      return client.replyMessage(event.replyToken,
        [flexBaccaratThunder,textBaccaratThunder]
      )
    }

    if (stateBaccaratCow.includes(event.message.text)) {
      return client.replyMessage(event.replyToken,
        [flexBaccaratCow,textBaccaratCow]
      )
    }

    if (stateComBaccarat.includes(event.message.text)) {
      return client.replyMessage(event.replyToken,
        [flexComBaccarat,textComBaccarat]
      )
    }

    if (statePlayBoxing.includes(event.message.text)) {
      return client.replyMessage(event.replyToken,
        [flexPlayBoxing,textPlayBoxing]
      )
    }

    if (stateBallCamp.includes(event.message.text)) {
      return client.replyMessage(event.replyToken,
        [flexBallCamp,textBallCamp]
      )
    }

    if (stateBallStep.includes(event.message.text)) {
      return client.replyMessage(event.replyToken,
        [flexBallStep,textBallStep]
      )
    }

    if (stateCheckBillBall.includes(event.message.text)) {
      return client.replyMessage(event.replyToken,
        [flexCheckBillBall,textCheckBillBall]
      )
    }

    if (statePlayBall.includes(event.message.text)) {
      return client.replyMessage(event.replyToken,
        [flexPlayBall,textPlayBall]
      )
    }

    if (stateAppHome.includes(event.message.text)) {
      return client.replyMessage(event.replyToken,
        [flexAppHome,textAppHome]
      )
    }

    if (stateNotChangeBet.includes(event.message.text)) {
      return client.replyMessage(event.replyToken,
        [textNotChangeBet]
      )
    }

    if (stateChangeLanguage.includes(event.message.text)) {
      return client.replyMessage(event.replyToken,
        [flexChangeLanguage,textChangeLanguage]
      )
    }

    if (stateNotRememberUser.includes(event.message.text)) {
      return client.replyMessage(event.replyToken,
        [textNotRememberUser]
      )
    }

    if (stateChangePhone.includes(event.message.text)) {
      return client.replyMessage(event.replyToken,
        [textChangePhone]
      )
    }

    if (stateForgetPassword.includes(event.message.text)) {
      return client.replyMessage(event.replyToken,
        [textForgetPassword]
      )
    }

    if (stateNotEnterWeb.includes(event.message.text)) {
      return client.replyMessage(event.replyToken,
        [flexNotEnterWeb,textNotEnterWeb]
      )
    }

    if (stateLongWithdraw.includes(event.message.text)) {
      return client.replyMessage(event.replyToken,
        [textLongWithdraw]
      )
    }

    if (stateIncompleteWithdraw.includes(event.message.text)) {
      return client.replyMessage(event.replyToken,
        [textIncompleteWithdraw]
      )
    }

    if (stateWithdraw.includes(event.message.text)) {
      return client.replyMessage(event.replyToken,
        [flexWithdraw,textWithdraw]
      )
    }

    if (stateMinimalDeposite.includes(event.message.text)) {
      return client.replyMessage(event.replyToken,
        [textMinimaDeposite]
      )
    }

    if (stateUploadSlip.includes(event.message.text)) {
      return client.replyMessage(event.replyToken,
        [flexUploadSlip, textUploadSlip]
      )
    }

    if (stateNoDeposite.includes(event.message.text)) {
      return client.replyMessage(event.replyToken,
        [flexNoDeposite, textNoDeposite]
      )
    }

    if (stateDeposite.includes(event.message.text)) {
      return client.replyMessage(event.replyToken,
        [flexDeposite, textDeposite]
      )
    }

    if (stateRegisterAdmin.includes(event.message.text)) {
      return client.replyMessage(event.replyToken,
        [textRegisterAdmin]
      )
    }

    if (stateRegisterProblem.includes(event.message.text)) {
      return client.replyMessage(event.replyToken,
        [textRegisterProblem]
      )
    }

    if (stateRegisterAuto.includes(event.message.text)) {
      return client.replyMessage(event.replyToken,
        [flexRegisterAuto, textRegisterAuto]
      )
    }


    if (event.message.text == 'ติดต่อเรา') {
      return client.replyMessage(event.replyToken, {
        type: 'flex',
        altText: 'เลือกหัวข้อที่ต้องการสอบถาม',
        contents: {
          "type": "bubble",
          "hero": {
            "type": "image",
            "url": "https://lh3.googleusercontent.com/d/1iPLMDqZoy_q8YjSMRbV-WY5QtDDB_u7Z",
            "size": "full",
            "aspectRatio": "20:13",
            "aspectMode": "cover"
          },
          "body": {
            "type": "box",
            "layout": "vertical",
            "contents": [
              {
                "type": "text",
                "text": "เลือกหัวข้อที่ต้องการสอบถาม",
                "align": "center",
                "size": "lg",
                "color": "#333333",
                "weight": "bold"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "สมัครสมาชิก",
                      "text": "#สมัครสมาชิก"
                    },
                    "margin": "none",
                    "height": "sm",
                    "style": "primary"
                  }
                ],
                "margin": "xs",
                "spacing": "none",
                "paddingAll": "xs"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "ฝาก-ถอน",
                      "text": "#ฝาก-ถอน"
                    },
                    "margin": "none",
                    "height": "sm",
                    "style": "primary"
                  }
                ],
                "margin": "xs",
                "spacing": "none",
                "paddingAll": "xs"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "แจ้งปัญหาการใช้งาน",
                      "text": "#แจ้งปัญหาการใช้งาน"
                    },
                    "margin": "none",
                    "height": "sm",
                    "style": "primary"
                  }
                ],
                "margin": "xs",
                "spacing": "none",
                "paddingAll": "xs"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "ข้อมูลการเล่นเกม",
                      "text": "#ข้อมูลการเล่นเกม"
                    },
                    "margin": "none",
                    "height": "sm",
                    "style": "primary"
                  }
                ],
                "margin": "xs",
                "spacing": "none",
                "paddingAll": "xs"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "โปรโมชั่น",
                      "text": "#โปรโมชั่น"
                    },
                    "margin": "none",
                    "height": "sm",
                    "style": "primary"
                  }
                ],
                "margin": "xs",
                "spacing": "none",
                "paddingAll": "xs"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "แนะนำเกม",
                      "text": "แนะนำเกม"
                    },
                    "margin": "none",
                    "height": "sm",
                    "style": "primary"
                  }
                ],
                "margin": "xs",
                "spacing": "none",
                "paddingAll": "xs"
              },
            ]
          },
          "styles": {
            "hero": {
              "separator": true
            }
          }
        }

      });

    }

    if (event.message.text == '#สมัครสมาชิก') {
      return client.replyMessage(event.replyToken, {
        type: 'flex',
        altText: 'สมัครสมาชิก',
        contents: {
          "type": "bubble",
          "hero": {
            "type": "image",
            "url": "https://lh3.googleusercontent.com/d/1HYjcbU8MsAzENbNLwjSmMqukXqaYxs6v",
            "size": "full",
            "aspectRatio": "20:13",
            "aspectMode": "cover"
          },
          "body": {
            "type": "box",
            "layout": "vertical",
            "contents": [
              {
                "type": "text",
                "text": "สมัครสมาชิก",
                "align": "center",
                "size": "xl",
                "color": "#333333",
                "weight": "bold"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "ต้องการสมัครสมาชิกออโต้",
                      "text": "ต้องการสมัครสมาชิกออโต้"
                    },
                    "margin": "none",
                    "height": "sm",
                    "style": "primary"
                  }
                ],
                "margin": "xs",
                "spacing": "none",
                "paddingAll": "xs"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "ต้องการให้เราสมัครสมาชิกให้",
                      "text": "ต้องการให้เราสมัครสมาชิกให้"
                    },
                    "margin": "none",
                    "height": "sm",
                    "style": "primary"
                  }
                ],
                "margin": "xs",
                "spacing": "none",
                "paddingAll": "xs"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "สมัครแล้ว ติดปัญหา",
                      "text": "สมัครแล้ว ติดปัญหา"
                    },
                    "margin": "none",
                    "height": "sm",
                    "style": "primary"
                  }
                ],
                "margin": "xs",
                "spacing": "none",
                "paddingAll": "xs"
              }
            ]
          },
          "styles": {
            "hero": {
              "separator": true
            }
          }
        }

      });

    }

    if (event.message.text == '#ฝาก-ถอน') {
      return client.replyMessage(event.replyToken, {
        type: 'flex',
        altText: 'ฝาก-ถอน',
        contents: {
          "type": "bubble",
          "hero": {
            "type": "image",
            "url": "https://lh3.googleusercontent.com/d/1DNYwl_c-Zs0YXDY-COydAKc-CP4R7EAF",
            "size": "full",
            "aspectRatio": "20:13",
            "aspectMode": "cover"
          },
          "body": {
            "type": "box",
            "layout": "vertical",
            "contents": [
              {
                "type": "text",
                "text": "ฝาก-ถอน",
                "align": "center",
                "size": "20px",
                "color": "#333333",
                "weight": "bold",
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "วิธีการฝากเงิน",
                      "text": "วิธีการฝากเงิน"
                    },
                    "margin": "none",
                    "height": "sm",
                    "style": "primary"
                  }
                ],
                "margin": "xs",
                "spacing": "none",
                "paddingAll": "xs"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "ฝากเงินไม่เข้า",
                      "text": "ฝากเงินไม่เข้า"
                    },
                    "margin": "none",
                    "height": "sm",
                    "style": "primary"
                  }
                ],
                "margin": "xs",
                "spacing": "none",
                "paddingAll": "xs"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "อัปโหลดสลิปไม่ได้",
                      "text": "อัปโหลดสลิปไม่ได้"
                    },
                    "margin": "none",
                    "height": "sm",
                    "style": "primary"
                  }
                ],
                "margin": "xs",
                "spacing": "none",
                "paddingAll": "xs"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "ฝาก - ถอนขั้นต่ำเท่าไหร่",
                      "text": "ฝาก - ถอนขั้นต่ำเท่าไหร่"
                    },
                    "margin": "none",
                    "height": "sm",
                    "style": "primary"
                  }
                ],
                "margin": "xs",
                "spacing": "none",
                "paddingAll": "xs"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "วิธีการถอนเงิน",
                      "text": "วิธีการถอนเงิน"
                    },
                    "margin": "none",
                    "height": "sm",
                    "style": "primary"
                  }
                ],
                "margin": "xs",
                "spacing": "none",
                "paddingAll": "xs"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "ถอนเงินแล้วได้เงินไม่ครบ",
                      "text": "ถอนเงินแล้วได้เงินไม่ครบ"
                    },
                    "margin": "none",
                    "height": "sm",
                    "style": "primary"
                  }
                ],
                "margin": "xs",
                "spacing": "none",
                "paddingAll": "xs"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "ถอนเงินนาน (ตรวจสอบ)",
                      "text": "ถอนเงินนาน (ตรวจสอบ)"
                    },
                    "margin": "none",
                    "height": "sm",
                    "style": "primary"
                  }
                ],
                "margin": "xs",
                "spacing": "none",
                "paddingAll": "xs"
              }
            ]
          },
          "styles": {
            "hero": {
              "separator": true
            }
          }
        }

      });

    }
    if (event.message.text == '#แจ้งปัญหาการใช้งาน') {
      return client.replyMessage(event.replyToken, {
        type: 'flex',
        altText: 'แจ้งปัญหาการใช้งาน',
        contents: {
          "type": "bubble",
          "hero": {
            "type": "image",
            "url": "https://lh3.googleusercontent.com/d/1xxVLosOXiOpxZMvf3tgKsPgkbZD4l4kV",
            "size": "full",
            "aspectRatio": "20:13",
            "aspectMode": "cover"
          },
          "body": {
            "type": "box",
            "layout": "vertical",
            "contents": [
              {
                "type": "text",
                "text": "แจ้งปัญหาการใช้งาน",
                "align": "center",
                "size": "xl",
                "color": "#333333",
                "weight": "bold"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "เข้าเว็บไม่ได้",
                      "text": "เข้าเว็บไม่ได้"
                    },
                    "margin": "none",
                    "height": "sm",
                    "style": "primary"
                  }
                ],
                "margin": "xs",
                "spacing": "none",
                "paddingAll": "xs"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "ลืมรหัสผ่าน",
                      "text": "ลืมรหัสผ่าน"
                    },
                    "margin": "none",
                    "height": "sm",
                    "style": "primary"
                  }
                ],
                "margin": "xs",
                "spacing": "none",
                "paddingAll": "xs"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "ต้องการเปลี่ยนเบอร์โทร",
                      "text": "ต้องการเปลี่ยนเบอร์โทร"
                    },
                    "margin": "none",
                    "height": "sm",
                    "style": "primary"
                  }
                ],
                "margin": "xs",
                "spacing": "none",
                "paddingAll": "xs"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "จำยูสไม่ได้",
                      "text": "จำยูสไม่ได้"
                    },
                    "margin": "none",
                    "height": "sm",
                    "style": "primary"
                  }
                ],
                "margin": "xs",
                "spacing": "none",
                "paddingAll": "xs"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "เปลี่ยนภาษายังไง",
                      "text": "เปลี่ยนภาษายังไง"
                    },
                    "margin": "none",
                    "height": "sm",
                    "style": "primary"
                  }
                ],
                "margin": "xs",
                "spacing": "none",
                "paddingAll": "xs"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "ปรับยอดเดิมพันเพิ่มไม่ได้",
                      "text": "ปรับยอดเดิมพันเพิ่มไม่ได้"
                    },
                    "margin": "none",
                    "height": "sm",
                    "style": "primary"
                  }
                ],
                "margin": "xs",
                "spacing": "none",
                "paddingAll": "xs"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "โหลดแอปลงหน้าโฮมยังไง",
                      "text": "โหลดแอปลงหน้าโฮมยังไง"
                    },
                    "margin": "none",
                    "height": "sm",
                    "style": "primary"
                  }
                ],
                "margin": "xs",
                "spacing": "none",
                "paddingAll": "xs"
              }
            ],
            "spacing": "0px"
          },
          "styles": {
            "hero": {
              "separator": true
            }
          }
        }

      });

    }

    if (event.message.text == '#ข้อมูลการเล่นเกม') {
      return client.replyMessage(event.replyToken, {
        type: 'flex',
        altText: 'ข้อมูลการเล่นเกม',
        contents: {
          "type": "bubble",
          "hero": {
            "type": "image",
            "url": "https://lh3.googleusercontent.com/d/1cNht6K9Th5bo30suMT6zzztLgDVgRKVQ",
            "size": "full",
            "aspectMode": "cover",
            "aspectRatio": "20:13"
          },
          "body": {
            "type": "box",
            "layout": "vertical",
            "contents": [
              {
                "type": "text",
                "text": "ข้อมูลการเล่นเกม",
                "size": "xl",
                "color": "#333333",
                "weight": "bold",
                "align": "center"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "วิธีแทงบอล",
                      "text": "วิธีแทงบอล"
                    },
                    "margin": "none",
                    "height": "sm",
                    "style": "primary"
                  }
                ],
                "margin": "xs",
                "spacing": "none",
                "paddingAll": "xs"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "วิธีดูบิลบอล",
                      "text": "วิธีดูบิลบอล"
                    },
                    "margin": "none",
                    "height": "sm",
                    "style": "primary"
                  }
                ],
                "margin": "xs",
                "spacing": "none",
                "paddingAll": "xs"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "วิธีแทงบอลสเต็ป",
                      "text": "วิธีแทงบอลสเต็ป"
                    },
                    "margin": "none",
                    "height": "sm",
                    "style": "primary"
                  }
                ],
                "margin": "xs",
                "spacing": "none",
                "paddingAll": "xs"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "แนะนำค่ายบอล",
                      "text": "แนะนำค่ายบอล"
                    },
                    "margin": "none",
                    "height": "sm",
                    "style": "primary"
                  }
                ],
                "margin": "xs",
                "spacing": "none",
                "paddingAll": "xs"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "วิธีแทงมวย",
                      "text": "วิธีแทงมวย"
                    },
                    "margin": "none",
                    "height": "sm",
                    "style": "primary"
                  }
                ],
                "margin": "xs",
                "spacing": "none",
                "paddingAll": "xs"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "วิธีปรับค่าคอมบาคาร่า",
                      "text": "วิธีปรับค่าคอมบาคาร่า"
                    },
                    "margin": "none",
                    "height": "sm",
                    "style": "primary"
                  }
                ],
                "margin": "xs",
                "spacing": "none",
                "paddingAll": "xs"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "วิธีเล่นบาคาร่าวัว",
                      "text": "วิธีเล่นบาคาร่าวัว"
                    },
                    "margin": "none",
                    "height": "sm",
                    "style": "primary"
                  }
                ],
                "margin": "xs",
                "spacing": "none",
                "paddingAll": "xs"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "วิธีเล่นบาคาร่าสายฟ้า",
                      "text": "วิธีเล่นบาคาร่าสายฟ้า"
                    },
                    "margin": "none",
                    "height": "sm",
                    "style": "primary"
                  }
                ],
                "margin": "xs",
                "spacing": "none",
                "paddingAll": "xs"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "วิธีการซื้อฟรีสปิน",
                      "text": "วิธีการซื้อฟรีสปิน"
                    },
                    "margin": "none",
                    "height": "sm",
                    "style": "primary"
                  }
                ],
                "margin": "xs",
                "spacing": "none",
                "paddingAll": "xs"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "วิธีปรับเบทสล็อต",
                      "text": "วิธีปรับเบทสล็อต"
                    },
                    "margin": "none",
                    "height": "sm",
                    "style": "primary"
                  }
                ],
                "margin": "xs",
                "spacing": "none",
                "paddingAll": "xs"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "วิธีเล่นไฮโล",
                      "text": "วิธีเล่นไฮโล"
                    },
                    "margin": "none",
                    "height": "sm",
                    "style": "primary"
                  }
                ],
                "margin": "xs",
                "spacing": "none",
                "paddingAll": "xs"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "วิธีเล่นรูเล็ต",
                      "text": "วิธีเล่นรูเล็ต"
                    },
                    "margin": "none",
                    "height": "sm",
                    "style": "primary"
                  }
                ],
                "margin": "xs",
                "spacing": "none",
                "paddingAll": "xs"
              }
            ],
            "spacing": "0px"
          },
          "styles": {
            "hero": {
              "separator": true
            }
          }
        }

      });

    }

    if (event.message.text == '#โปรโมชั่น') {
      return client.replyMessage(event.replyToken, {
        type: 'flex',
        altText: 'โปรโมชั่น',
        contents: {
          "type": "bubble",
          "hero": {
            "type": "image",
            "url": "https://lh3.googleusercontent.com/d/1DV2Ua4Yp6Wf9pWPogunaxmXRPRJBL2bd",
            "size": "full",
            "aspectMode": "cover",
            "aspectRatio": "20:13"
          },
          "body": {
            "type": "box",
            "layout": "vertical",
            "contents": [
              {
                "type": "text",
                "text": "โปรโมชั่น",
                "size": "xl",
                "color": "#333333",
                "weight": "bold",
                "align": "start"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "ฝากรับสูตร",
                      "text": "ฝากรับสูตร"
                    },
                    "margin": "none",
                    "height": "sm",
                    "style": "primary"
                  }
                ],
                "margin": "xs",
                "spacing": "none",
                "paddingAll": "xs"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "โปรกีฬา5%",
                      "text": "โปรกีฬา5%"
                    },
                    "margin": "none",
                    "height": "sm",
                    "style": "primary"
                  }
                ],
                "spacing": "none",
                "margin": "xs",
                "paddingAll": "xs"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "โปรมวย10%",
                      "text": "โปรมวย10%"
                    },
                    "margin": "none",
                    "height": "sm",
                    "style": "primary"
                  }
                ],
                "spacing": "none",
                "margin": "xs",
                "paddingAll": "xs"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "โปรวันเกิด",
                      "text": "โปรวันเกิด"
                    },
                    "margin": "none",
                    "height": "sm",
                    "style": "primary"
                  }
                ],
                "spacing": "none",
                "margin": "xs",
                "paddingAll": "xs"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "โปรคืนยอดเสีย",
                      "text": "โปรคืนยอดเสีย"
                    },
                    "margin": "none",
                    "height": "sm",
                    "style": "primary"
                  }
                ],
                "spacing": "none",
                "margin": "xs",
                "paddingAll": "xs"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "โปรทายเลขท้าย",
                      "text": "โปรทายเลขท้าย"
                    },
                    "margin": "none",
                    "height": "sm",
                    "style": "primary"
                  }
                ],
                "spacing": "none",
                "margin": "xs",
                "paddingAll": "xs"
              },
              {
                "type": "box",
                "layout": "vertical",
                "contents": [
                  {
                    "type": "button",
                    "action": {
                      "type": "message",
                      "label": "โปรแนะนำเพื่อน",
                      "text": "โปรแนะนำเพื่อน"
                    },
                    "margin": "none",
                    "height": "sm",
                    "style": "primary"
                  }
                ],
                "spacing": "none",
                "margin": "xs",
                "paddingAll": "xs"
              }
            ],
            "spacing": "0px"
          },
          "styles": {
            "hero": {
              "separator": true
            }
          }
        }

      });

    }


    
    if (!stateAll.includes(event.message.text)) {
      return client.replyMessage(event.replyToken,
        [flexMenu]
      )
    }


  }
}




console.log(config)

app.get('/', (req, res) => {
  res.send('ok');
})

app.listen(port, () => console.log(`Start server on port ${port}`))